Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: As you see, you could create several programs that begin to run when changing the background to a given scenario, or to receive a particular message, or when the room volume exceeds a certain threshold, when the video motion is greater than a number pixel concrete or when the timer has exceeded the value you want. Therefore, there are many possibilities to make things happen in your programs simultaneously. Do you dare to investigate how works?
el: Όπως βλέπετε μπορούμε να δημιουργήσουμε διάφορα προγράμματα που ξεκινούν την εκτέλεσή τους όταν αλλάζει το υπόβαθρο, ή όταν λάβουν ένα συγκεκριμένο μήνυμα ή όταν η ένταση από το μικρόφωνο ξεπερνάει ένα κατώφλι ή όταν η κίνηση από την κάμερα είναι μεγαλύτερη από ένα σύνολο εικονοστοιχείων ή όταν το χρονόμετρο έχει ξεπεράσει την τιμή που θέλετε. Επομένως, υπάρχουν πολλές δυνατότητες να κάνετε πράγματα να συμβαίνουν ταυτόχρονα στα προγράμματά σας. Τολμήστε να δείτε πως δουλεύουν.
ru: Как вы видите, вы могли бы создать несколько программ, которые начнут выполняться, когда изменится фон, когда получим нужное сообщение, или когда уровень громкости достигнет нужного значения, или скорость видео выше значения, или когда таймер достигнет нужного значения. Таим образом, существует есть много возможностей запустить вещи одновременно. Хотите попробовать как это работает?

source: Instructions related to synchronization <b>allow our characters to organize things happen in the order we want</b>.
el: Οι εντολές συγχρονισμού <b>σας επιτρέπουν να προγραμματίζετε τους χαρακτήρες να εκτελούν εντολές με τη σειρά που θέλετε</b>.
ru: Инструкции связанные с синхронизацией <b>позволяют нашим героям организовывать вещи, чтобы они происходили в том порядке, который нам нужен</b>.

source: The easiest way to synchronize the behavior of your characters is using a <i>'wait'</i> block, which makes the character waits the number of seconds you write as a parameter block. An example of how this block can be used to synchronize two characters:
el: Ο ευκολότερος τρόπος να συγχρονίσετε τη συμπεριφορά των χαρακτήρων σας είναι χρησιμοποιώντας την εντολή <i>'περίμενε'</i>, η οποία κάνει τον χαρακτήρα να περιμένει τον αριθμό των δευτερολέπτων που θα δώσετε σαν παράμετρο. Ένα παράδειγμα του τρόπου με τον οποίο αυτές οι εντολές μπορούν να χρησιμοποιηθούν για να συγχρονιστούν δύο χαρακτήρες:
ru: Самый простой способ синхроннизировать поведение персонажей это использовать <i>'wait'</i> блок, который указывает персонажу ждать то число секунд которое вы указываете в параметрк. В качестве примера работы блоков посмотрим каксинхронизируются два персонажа:

source: say [Hello, how are you?] for (2) secs
el: πες [Γεια σου, τι κάνεις;] για (2) δευτερόλεπτα
eu: [Kaixo, zer moduz zaude?] esan (2) segunduz
ru: говорить [Привет как дела?] (2) секунд

source: wait (2) secs
el: περίμενε (2) δευτερόλεπτα
eu: (2) segunduz itxaron
ru: ждать (2) секунд

source: say [Well, do you want to play hide-and seek?] for (3) secs
el: πες [Καλά, θες να παίξουμε κρυφτό;] για (3) δευτερόλεπτα
eu: esan[] (3) segunduz
ru: говорить [Ну, ты хочешь играть в прятки?] (3) секунд

source: say [Let's go] for (2) secs
el: πες [Πάμε] για (2) δευτερόλεπτα
eu: esan[Goazen] (2) segunduz
ru: говорить [Пошли] (2) секунд

source: say [I'm fine, thanks!] for (2) secs
el: πες [Είμαι καλά, ευχαριστώ!] για (2) δευτερόλεπτα
eu: esan [Ondo nago, eskerrik asko!] (2) segunduz
ru: говорить [Я хорошо, спасибо!] (2) секунд

source: wait (3) secs
el: περίμενε (3) δευτερόλεπτα
eu: (3) segunduz itxaron
ru: ждать (3) секунд

source: say [Yes] for (1) secs
el: πες [Ναι] για (1) δευτερόλεπτα
eu: esan [Bai] (1) segunduz
ru: говорить [да] (1) секунд

source: In this case it uses blocks <i>'wait'</i> to synchronize these two characters to maintain a conversation, so that while one speaks, the other character waits, and vice versa. Note that the number of seconds that each character expected, are equal to the number of seconds that the other character speaks, so they never talk at the same time.
el: Σε αυτή την περίπτωση χρησιμοποιούμε την εντολή <i>'περίμενε'</i> για να συγχρονίσουμε δύο χαρακτήρες να διεξάγουν μια συζήτηση, έτσι ώστε καθώς ο ένας μιλάει, ο άλλος χαρακτήρας να περιμένει, και το αντίθετο. Σημειώστε πως ο αριθμός των δευτερολέπτων που ο κάθε χαρακτήρας περιμένει είναι ο αριθμός των δευτερολέπτων που ο άλλος χαρακτήρας μιλάει, έτσι ώστε να μη μιλάνε την ίδια στιγμή.
ru: В этом случае блок <i>'wait'</i> используется для синхронизации двух персонажей ведущих разговор, так что когда один говорит, другой персонаж ждет, и наоборот. Обратите внимание что число секунд, когда один персонаж ждет, равно числу секун, когда другой персонаж говорит, так что они никогда не говорят одновременно.

source: Synchronization using blocks <i>'wait'</i> is very simple when programs are small and have few characters, but when are larger, or when we have several characters, or when conditions to generate a reaction can not be measured previously, it is more efficient to use other modes of synchronization and messages. Here's an example:
el: Ο συγχρονισμός χρησιμοποιώντας τις εντολές <i>'περίμενε'</i> είναι πολύ απλός όταν τα προγράμματα είναι μικρά και έχουν λίγους χαρακτήρες, αλλά όταν είναι μεγαλύτερα και έχουν πολλούς χαρακτήρες ή όταν αντιδρούν σε κάποια γεγονότα που δεν ξέρουμε πότε θα γίνουν, είναι πιο αποδοτικό να χρησιμοποιείστε άλλους τρόπους συγχρονισμού και τα μηνύματα. Δείτε ένα παράδειγμα:
ru: Синхронизация с использованием блока <i>'wait'</i> очень проста, когда программы малыи в них только несколько персонажей, но если программы большие или там несколько персонажей или есть условия, которые порождают реакцию, которая не может быть измрена предварительно, то разумнее использовать другие способы синхонизации и обмен сообщениями. Вот пример:

source: if &lt; touching [mouse pointer v]?&gt;then
el: εάν &lt;αγγίζει [δείκτη του ποντικού v]? &gt; τότε
eu: baldin &lt; ikutzen []?&gt;orduan
ru: если &lt;касается [указатель мыши v] ?&gt; , то

source: broadcast [catched! v]
el: μετάδωσε [πιάστηκε! v]
eu: emanaldia[]
ru: передать [поймала! v]

source: when I receive [catched! v]
el: Όταν λάβω το [πιάστηκε! v]
eu: [] nik jasotzean
ru: когда я получу [поймала! v]

source: say [You have catched my friend] for (2) secs
el: πες [Έπιασες τον φίλο μου] για (2) δευτερόλεπτα
eu: esan[] (2) segunduz
ru: говорить [Вы поймали моего друга] (2) секунд

source: say [Now, you have to catch me!] for (2) secs
el: πες [Τώρα πρέπει να με πιάσεις!] για (2) δευτερόλεπτα
eu: esan [](2) segunduz
ru: говорить [Теперь вы должны поймать меня!] (2) секунд

source: How do these syncblocks work? When a situation occurs in a character we want to cause a reaction in another character, we can use <b>messaging</b>. In the example, when the mouse touches the cat, the message 'Caught!', which will be sent to all the characters of the project is sent. Thus, when the butterfly receives the message 'Caught!', the instructions on the block <i>'when receive 'caught!'</i>'. Therefore, when the user touches the cat whit the mouse, butterfly says, 'You caught my companion. Now you have to catch me!'.
el: Πώς δουλεύουν αυτές οι εντολές συγχρονισμού; Όταν ένα γεγονός συμβεί σε έναν χαρκατήρα και θέλουμε να αντιδράσει κάποιος άλλος χαρακτήρας, μπορούμε να χρησιμοποιήσουμε <b>τα μηνύματα.</b>. Στο παράδειγμα, αν γίνει κλικ στη γάτα, το μήνυμα 'πιάστηκε!' μεταδίδεται σε όλους τους χαρακτήρες του προγράμματος. Έτσι, όταν η πεταλούδα λάβει το μήνυμα 'πιάστηκε!', οι εντολές κάτω από την <i>'Όταν λάβω το 'πιάστηκε!'</i>. Επομένως, όταν ο χρήστης κάνει κλικ στη γάτα με το ποντίκι, <i>η πεταλούδα</i> λέει 'Έπιασες τον φίλο μου'.
ru: Как работает синхронизация? Когда возникает ситуация, когда один персонаж должен служить причиной активности другого персонажа, мы можем использовать <b>обмен сообщениями</b>.Например, когда мышь касается кошки, сообщение 'Caught!', посылается всем персонажам проекта. Таким образом, когда бабочка получает сообщение 'Caught!', выполняется инструкция <i>'when receive 'caught!'</i>'. Таким образом, когда пользователь касается кошки мышкой, бабочка говорит, 'You caught my companion. Now you have to catch me!'.

source: In addition to sending messages, you can synchronize characters to make things happen in the order we want, using other blocks, such as <i>'wait until'</i> or <i>'when the background changes to ...'</i>.
el: Εκτός από τα μηνύματα, μπορείτε να συγχρονίσετε χαρακτήρες ώστε τα πράγματα να συμβαίνουν με τη σειρά που θέλουμε χρησιμοποιώντας και άλλες εντολές, όπως τη <i>'περίμενε ώσπου...'</i> ή την <i>'Όταν το υπόβαθρο αλλάξει σε...'</i>,
ru: В дополнению к обмену сообщениями, вы можете синхронизировать персонажей позволяя вещам случаться в нужном порядке, использую другие блоки, такие как <i>'wait until'</i> или <i>'when the background changes to ...'</i>.

source: wait until &lt;(lives) =[0]&gt;
el: περίμενε ώσπου &lt;(ζωές) = [0]&gt;
ru: ждать до <(жизни) = [0]>

source: say [Game over] for (2) secs
el: πες [Τέλος παιχνιδιού] για (2) δευτερόλεπτα
ru: говорить [Игра закончена] (2) секунд

source: when backdrop switches to [Spring v]
el: Όταν το υπόβαθρο αλλάξει σε [Άνοιξη v]
ru: когда фон сменился на [весна v]

source: say [Spring has come!] for (2) secs
el: πες [Ήρθε η άνοιξη!] για (2) δευτερόλεπτα
ru: говорить [Наступила весна!] (2) секунд

source: In the first example, when program execution reaches that point will stop until the condition is met in this case, until life is equal to 0. When lives equal to 0, then continue execution of the remaining blocks, this case, <i>'said Game Over'</i> and <i>'stop all'</i>, which ends the execution of the project.
el: Στο πρώτο παράδειγμα, όταν η εκτέλεση του προγράμματος φτάσει σε αυτό το σημείο θα σταματήσει μέχρι η συνθήκη να ισχύσει, στην περίπτωσή μας μέχρι να τελειώσουν οι ζωές, τότε η εκτέλεση θα συνεχιστεί, στην περίπτωση μας θα εκτελεστεί η <i>'πες Τέλος παιχνιδιού'</i> και η <i>'σταμάτησε όλα'</i>, που σταματάει την εκτέλεση.
ru: В первом примере, программа дойдя до этой точки остановится до тех пор, пока условие не будет выполнено, т.е. пока значение жизни не будет равно 0. Когда число жизней будет 0, выполнение блоков продолжиться, и в этом случае, будет <i>'сказано Game Over'</i> и <i>'stop all'</i>, приведет к завершениювыполнения всего проекта.

source: In the second example, the moment when the scene changes to the backdrop with the name 'Spring', the character will execute the blocks placed after the instruction 'when the backdrop changes to Spring', ie to be displayed and will say 'spring has come!'.
el: Στο δεύτερο παράδειγμα, τη στιγμή που το υπόβαθρο αλλάζει και γίνεται 'Άνοιξη', ο χαρακτήρας θα εκτελέσει τις εντολές που είναι κάτω από το 'Όταν το υπόβαθρο αλλάξει σε Άνοιξη', δηλαδή να πει 'Ήρθε η άνοιξη!'΄.
ru: Во втором примере, когда фон сцены поменяется на фон с именем 'Spring', герой перейдет к выполнению блока команд, находящихся после инструкции 'when the backdrop changes to Spring', и скажет 'spring has come!'.

source: The instructions related to user interactivity can <b>help your Scratch projects be more interactive</b>, ie the person who is running it can perform actions that provoke new situations in the project. For example, I can use the keyboard or mouse to move a character, you can answer questions or playing computer webcam, among many other possibilities.
el: Οι εντολές που σχετίζονται με την αλληλεπίδραση χρήστη <b>μπορούν να βοηθήσουν τα έργα σας να είναι πιο αλληλεπιδραστικά</b>, δηλαδή αυτός που εκτελεί το πρόγραμμά σας να μπορεί να κάνει ενέργειες στο έργο σας. Για παράδειγμα, να μπορεί να χρησιμοποιήσει το πληκτρολόγιο ή το ποντίκι του υπολογιστεί για να κινήσει έναν χαρακτήρα, να μπορεί να απαντήσει ερωτήσεις ή να παίξει το παιχνίδι σας με την κάμερα και το μικρόφωνο του υπολογιστή κ.α.
ru: Инструкции связанные с интерактивностью <b>помогут вашим Scratch проектам быть более интерактивными</b>, т.е. запустивший проект может выполнять действия, которые приведут к новым ситуациям. Например, я могу использовать мышь или клавиатуру, чтобы управлять героем, вы можете ответать на вопросы или играть с видеокамерой компьютера или использовать другие возможности.

source: The most basic block you can start working interactivity with the user is <i>'when green flag clicked'</i>.
el: Η πιο βασική εντολή με την οποία μπορείτε να ξεκινήσετε την αλληλεπίδραση χρήστη είναι η <i>'Όταν στην πράσινη σημαία γίνει κλικ'</i>
ru: Самый часто используемый блок, с которого начинается работа с интерактивными возможностями это -<i>'when green flag clicked'</i>.

source: How this block works? When the user who wants to run your project Scratch clicks on the green flag, all blocks were placed under the block <i>'when green flag clicked'</i> begin to run. You can have as many programs as you need to start with this block.
el: Πώς δουλεύει αυτή η εντολή; Όταν ο χρήστης που θέλει να εκτελέσει το πρόγραμμά σας πατήσει στην πράσινη σημαία, όλες οι εντολές που είναι κάτω από το <i>'Όταν στην πράσινη σημαία γίνει κλικ'</i> ξεκινούν να εκτελούνται. Μπορει΄τε να έχετε όσα προγράμματα θέλετε να ξεκινούν με αυτή την εντολή.
ru: Как работает этот блок? Когда пользователь, который хочет запустить проект Scratchщелкает на зеленый флаг, все блоки были помещены под блоком <i>'when green flag clicked'</i> начинают выполнятьмся. Вы можете привязать к этому флагу столько программ сколько вам нужно.

source: Now that you have begun to interact with the user running your Scratch project, perhaps you can try some of the following blocks:
el: Τώρα που έχετε αρχίσει να αλληλεπιδράτε με τον χρήστη που τρέχει το έργο Scratch που φτιάχνετε, μπορείτε να δοκιμάσετε κάποιες από τις επόμενες εντολές:
ru: Теперь, когда вы начали взаимодействовать с пользователем, выполняющим вашScratch проект, возможно вы захотите попробовать следующие блоки:

source: when [right arrow v] key pressed
el: Όταν το πλήκτρο [αριστερό βέλος v] πατηθεί
ru: когда клавиша [правая стрелка v] нажата

source: say [Hello] for (2) secs
el: πες [Hello] για (2) δευτερόλεπτα
ru: говорить [Привет] (2) секунд

source: ask [What's your name?] and wait
el: ρώτησε [Βάλε ένα όνομα μαθητή] και περίμενε
ru: спросить [Как вас зовут?] и ждать

source: say (join [Hello] [answer])
ru: сказать (объединить [Привет] [ответ])

source: if &lt;touching [mouse-pointer v] &gt; then
el: εάν &lt;αγγίζει [δείκτη του ποντικού v]? &gt; τότε
ru: если &lt;касается [указатель мыши v] ?&gt; , то

source: say [You caught me!]
el: πες [Με έπιασες]
ru: сказать [Ты поймал меня!]

source: mouse down?
el: κατέβασε την πένα
ru: мышь нажата?

source: go to [mouse-pointer v]
el: εάν &lt;αγγίζει [δείκτη του ποντικού v]? &gt; τότε
ru: перейти на [указатель мыши v]

source: As you see, you can allow users to interact with your characters by pressing keys to move, writing answers to questions and your characters use user responses, move characters with the mouse, or perform actions when the user clicks an object.
el: Όπως βλέπετε, μπορείτε να επιτρέψετε στους χρήστες να αλληλεπιδρούν με τους χαρακτήρες είτε πατώντας κουμπιά για να κινηθούν, ή γράφοντας απαντήσεις σε ερωτήσεις τις οποίες ο χαρακτήρας σας θα χρησιμοποιεί, ή κινώντας χαρακτήρες με το ποντίκι, ή εκτελώντας κάποιες ενέργειες όταν γίνει κλικ με το ποντίκι.
ru: Как вы видите, вы можете разрешить пользователям взаимодействовать с вашими персонажами, нажимая клавиши для движения, отвечая на вопросы, которые задают ваши персонажи, перемещая персонажей при помощи мышки, или выполняя действия в ответ на нажатие на объекты.

source: One of the funniest Scratch possibilities in terms of user interactivity is the possibility that <b>the user can use your webcam or microphone to interact with characters from Scratch or sound to trigger certain actions.</b>
el: Μία από τις πιο ενδιαφέρουσες δυνατότητες που παρέχονται όσον αφορά την αλληλεπίδραση χρήστη είναι ότι <b>οι χρήστες μπορούν να χρησιμοποιήσουν την κάμερα ή το μικρόφωνο για να αλληλεπιδράσουν με χαρακτήρες του Scratch ή να εκτελέσουν κάποια ενέργεια.</b>
ru: Одна из самых забавных возможностей Scratch с точки зрения интерактивности пользователявозможность того что <b>пользователь использует веб-камеру или микрофон взаимодействуя с персонажами или запуская какие-то действия, влияя на систему громкостью звука.</b>

source: if &lt;(loudness) >[30]&gt; then
el: εάν &lt; αγγίζει το χρώμα[#00000FF]?&gt; τότε
ru: если &lt;(громкость) > [30]&gt; , то

source: say [There is much noise...]
ru: сказать [Там много шума ...]

source: video [motion v] on [sprite v]
ru: видео [движение v] на [cпрайт v]

source: video [direction v] on [sprite v]
ru: видео [направление v] на [cпрайт v]

source: As you can see in the examples, we can make certain sets of blocks are executed when the ambient sound captured by the microphone is greater than a certain threshold, or when video motion occurs over an object or background. The possibilities of these blocks are very large and allows your creations Scratch are fully interactive with users.
el: Όπως βλέπετε στα παραδείγματα, μπορούμε να κάνουμε ένα σύνολο εντολών να εκτελεστεί όταν ο ήχος από το μικρόφωνο είναι μεγαλύτερος από ένα κατώφλι, ή όταν η κίνηση του βίντεο συμβαίνει πίσω από ένα αντικείμενο. Αυτές οι δυνατότητες μπορούν να χρησιμοποιηθούν σε ευρεία γκάμα έργων και επιτρέπουν πλήρη αλληλεπίδραση με τους χρήστες.
ru: Как вы можете видеть в этих примерах, мы можем сделать определенные наборы блоков, которые будут выполняться, когда звук микрофона становится больше чем определенное значение, или когда видео появляется над объектом или фоном Возможности этих блоков значительны и позволяют вашим Scratch проектам быть полностью интерактивными

source: Attribute Initialization
el: Αρχικοποίηση ιδιοτήτων
eu: Ongi hasieratzen ez diren atributuak
ru: Инициализация атрибутов

source: One of the mistakes that many programmers repeat when they learn to program is not initialize correctly the objects's attributes. What are the attributes? They are character's features that can be modified in the execution of a project, like their position, their size, their color, their orientation...
el: Ένα από τα λάθη που πολλοί προγραμματιστές επαναλαμβάνουν όταν μαθαίνουν προγραμματισμό είναι ότι δεν αρχικοποιούν σωστά τις ιδιότητες των αντικειμένων. Τι είναι οι ιδιότητες; Είναι τα χαρακτηριστικά των αντικειμένων που μπορούν να τροποποιηθούν κατά την εκτέλεση ενός προγράμματος, όπως η θέση, το μέγεθος, το χρώμα, η κατεύθυνση κ.α.
ru: Одна из ошибок, которые повторяют многие программисты, когда они учатся программировать, не правильно инициализировать атрибуты объектов. Что такое атрибуты? Это характеристики объекта, которые могут изменяться в ходевыполнения проекта, такие как положение, размер, цвет, направление...

source: When you have blocks than modify character's feature, you should always have a program which, when the program begins, asigns the value that we want to start. For example, if it modifies the position of a character, we should have the block 'go to' under the block 'when green flag clicked', in order to place the character in its initial position.
el: Όταν έχετε εντολές που τροποποιούν κάποια από τα χαρακτηριστικά των αντικειμένων, θα πρέπει πάντα να έχετε ένα πρόγραμμα που στην εκκίνηση θα θέτει τις τιμές με τις οποίες θέλουμε να ξεκινήσουμε. Για παράδειγμα, αν τροποποιούμε τη θέση του χαρακτήρα, θα πρέπει να έχουμε την εντολή 'πήγαινε στη θέση' κάτω από την εντολή 'Όταν στην πράσινη σημαία γίνει κλικ', για να τοποθετήσουμε τον χαρακτήρα στην αρχική του θέση.
ru: Когда у вас есть блоки, чем функция изменения персонажа, вы всегда должны в начале работы программы установить необходимые стартовые значения.Например, если в проекте меняется положение персонажа, обязательно должне быть блок 'go to' сразу после 'when green flag clicked', как приказ поставить персонаж в исходную позицию.

source: when [right arrow v] key pressed //Not initialized correctly.
el: Όταν το πλήκτρο [δεξί βέλος v] πατηθεί //Δεν υπάρχει σωστή αρχικοποίηση
ru: когда клавиша [правая стрелка v] нажата //Не правильно инициализирован.

source: change x by (10)
el: άλλαξε το x κατά (10)
ru: изменить x на (10)

source: when [left arrow v] key pressed
el: Όταν το πλήκτρο [αριστερό βέλος v] πατηθεί
ru: когда клавиша [стрелка влево v] нажата

source: change x by (-10)
el: άλλαξε το x κατά (-10)
ru: изменить x на (-10)

source: when [right arrow v] key pressed //Initialized correctly.
el: Όταν το πλήκτρο [δεξί βέλος v] πατηθεί //Σωστή αρχικοποίηση
ru: когда клавиша [правая стрелка v] нажата //Инициализирован правильно.

source: Dead code are parts of programs that never are executed. How can it form? For example, when you have a program that isn't start with a hat block, or when there is a program that is waiting for a message that never is sent.
el: Πώς μπορεί να προκύψει κώδικας που δεν εκτελείται; Για παράδειγμα, όταν έχετε ένα πρόγραμμα που δεν ξεκινάει με ένα από τα Συμβάντα (εντολές καπέλα), ή όταν ένα πρόγραμμα περιμένει ένα μήνυμα που κανείς ποτέ δεν το μεταδίδει.
ru: Мертвый код - это части программ, которые никогда не выполняются. Как он может возникнуть? Например, когда у вас есть программа, которая не начинается иликогда есть программа, которая ждет сообщения, которое никогда не будет послано.

source: forever //Blocks that do not start with a hat block.
ru: повторять всегда //Блоки, которые не начинаются с блока шляпы.

source: if &lt; key [left arrow v] pressed ? &gt; then
el: εάν &lt; πατήθηκε το πλήκτρο [αριστερό βέλος v] &gt; τότε
ru: если &lt;клавиша [стрелка влево v] нажата?&gt; , то

source: when I receive [startcc v] //Blocks that start with a hat block.
el: Όταν λάβω το [εκκίνηση v]//Εντολές που ξεκινάν με συμβάν
ru: когда я получу [startcc v] //Блоки, которые начинаются с блока шляпы.

source: switch costume to [costume2 v]
el: άλλαξε την ενδυμασία σε [costume2 v]
ru: изменить костюм на [костюм2 v]

source: say [Let's start] for (2) secs
el: πες [Ξεκίνα] για (2) δευτερόλεπτα
ru: говорить [Давайте начнем] (2) секунд

source: set rotation style [left-rigt v]
el: όρισε τον άξονα περιστροφής σε [οριζόντιο v]
ru: установить способ вращения [оставил-правильно v]

source: repeat (10)
el: επανάλαβε (10)
ru: повторить (10) раз

source: move (2) steps
el: κινήσου (2) βήματα
ru: идти (2) шагов

source: when I receive [message2 v]
el: Όταν λάβω το [message2 v]
ru: когда я получу [сообщение2 v]

source: repeat (5)
el: επανάλαβε (5)
ru: повторить (5) раз

source: move (4) steps
el: κινήσου (4) βήματα
ru: идти (4) шагов

source: What would happen if we make a small change? We would have to modify both programs, complicating the maintenance of the code. In these situations is more appropriate that the programmer make his own block that defines this behaviour and use this new block in all programs where needed.
el: Τι θα συμβεί αν πρέπει να κάνουμε μια μικρή αλλαγή; Θα πρέπει να τροποποιήσουμε και τα δύο προγράμματα, δυσκολεύοντας έτσι την συντήρηση του κώδικα. Σε αυτές τις περιπτώσεις είναι κατάλληλο ο προγραμματιστής να δημιουργήσει τις δικές του εντολές ώστε να κωδικοποίηση τη συμπεριφορά που θέλει και να την χρησιμοποιεί όπου χρειάζεται.
ru: Что произойдет, если мы сделаем небольшое изменение? Нам пришлось бы изменить обепрограммы, и было бы сложно преобразовать код. В этом случае было бы удобнее, если бы программист создал бы свой собственный блок и определил бы его поведение и использовал бы этот блок внутри нужных программ.

source: define walk (repetitions)(step)(pause)
el: όρισε περπάτα(επαναλήψεις)(βήματα)(παύση)
ru: определить ходить (повторы) (шаг) (Пауза)

source: repeat (repetitions)
el: επανάλαβε (επαναλήψεις)
ru: повторить (повторы) раз

source: move (step) steps
el: κινήσου (βήματα) βήματα
ru: идти (шаг) шагов

source: wait (pause) secs
el: περίμενε (παύση) δευτερόλεπτα
ru: ждать (Пауза) секунд
