Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: What we do with the list? We could, for example, use it to get a volunteer to carry out an exercise to the whiteboard. Look at the new instructions added to the program:
el: Τι μπορούμε να κάνουμε με τη λίστα; Θα μπορούσαμε, για παράδειγμα, να τη χρησιμοποιήσουμε για να βρούμε έναν εθελοντή για να γράψει μια άσκηση στον πίνακα. Οι νέες εντολές θα είναι οι εξής:
eu: Ze egin dezakegu zerrendarekin? Egin genezake, adibidez, boluntarioren bat arbel digitalera ariketa bat egitera ateratzeko erabili. Aditu iezaiezuejarraian programari gehitu dizkiogun argibideei:
ru: Что мы делаем со списком? Мы могли бы, например, использовать его, чтобы получить добровольцадля выполнения упражнения на доске. Посмотрите на новые инструкции добавленные к программе:

source: say [Today's volunteer will be...] for (2) secs
el: πες [Ο σημερινός εθελοντής θα είναι...] για (2) δευτερόλεπτα
eu: esan [Gaurko boluntarioa izango da...] (2) segunduz
ru: говорить [Сегодняшний волонтер будет...] (2) секунд

source: say (item(pick random (1) to (3)) of [Students v]) for (2) secs
el: πες (το στοιχείο (επίλεξε έναν τυχαίο αριθμό από το (1) μέχρι το (3)) της λίστας [Μαθητές v]) για (2) δευτερόλεπτα
eu: esan (elementua(ausazko zenbakia (1) eta (3) artean)) [Ikasleak v] (2)segunduz
ru: говорить (элемент (выдать случайное от (1) до (3)) в [Ученики v]) (2) секунд

source: We generated a random number between 1 and 3, which are the elements in the list, we selected the element that occupies that position in the list. Sometimes we take the name that is in position 1, others that it is in position 2 and the other at 3.
el: Δημιουργήσαμε έναν τυχαίο αριθμό από το 1 έως το 3, τα οποία είναι τα στοιχεία της λίστας, επιλέξαμε το στοιχείο που καταλαμβάνει αυτή την θέση στην λίστα. Μερικές φορές παίρνουμε το όνομα που είναι στη θέση 1 άλλες αυτό που είναι στη θέση 2 και τέλος αυτό που είναι στη θέση 3.
eu: Ausazko zenbaki bat sortu dugu 1 eta 3 artea, listan dauden elemenntuakdira, eta listan posizio hori okupatzen duena hautatu dugu. Batzutan 1posizioan dagoen izena hartuko dugu
ru: Мы сгенерировали случайное число между 1 и 3, которые являются числом элементов в списке, мы выбрали элемент, который занимает это положение в списке. Иногда мы выбираем имя в позиции 1, иногда в 2 а иногда в 3

source: Lists have many possibilities and many available operations ... you dare to investigate how they work?
el: Οι λίστες έχουν πολλές δυνατότητες και αρκετές εντολές ... τολμήστε να τις διερευνήσετε...
ru: В списках есть много возможностей и много доступных операций ... вы решитесь исследовать как они работают?

source: Instructions related to algorithmic notions of flow control can help you to <b>control the behavior of your characters</b>, making, for example, certain blocks that are repeated a number of times, or until a situation arises.
el: Εντολές σχετικές με τους αλγόριθμους και τον έλεγχο ροής που μπορούν να βοηθήσουν στο <b>να ελεγχθεί η συμπεριφορά των χαρακτήρων</b>, φτιάχνοντας για παράδειγμα, συγκεκριμένες εντολές να εκτελεστούν συγκεκριμένο αριθμό φορών, ή μέχρι κάτι να συμβεί.
ru: Инструкции, связанные с алгоритмическими понятиями управления потоком, могут помочь вам <b>контролировать поведение персонажа</b>, создавая, наприимер, определенные блоки, которые выполняются несколько раз, или пока не возникнет нужная ситуация.

source: The most basic way to control the behavior of your characters is creating a <b>program composed of a set of blocks are executed one after another</b>, as we see in the picture:
el: Ο πιο βασικές τρόπος ελέγχου της συμπεριφοράς ενός χαρακτήρα είναι να δημιουργηθεί ένα <b>πρόγραμμα που αποτελείται από εντολές που εκτελούνται στη σειρά η μία μετά την άλλη</b>, όπως βλέπουμε παρακάτω:
ru: Самый простой способ контролировать поведение ваших персонажей - создать <b>программа, состоящая из набора блоков, выполняется один за другим</b>, как мы видим на рисунке:

source: say [I'm a dancer cat] for (2) secs
el: πες [Είμαι μια γάτα που χορεύει] για (2) δευτερόλεπτα
ru: говорить [Я танцующая кошка] (2) секунд

source: wait (0.5) secs
el: περίμενε (0.5) δευτερόλεπτα
ru: ждать (0.5) секунд

source: move (-10) steps
el: κινήσου (-10) βήματα
ru: идти (-10) шагов

source: How does this program works? When the user click on the green flag run behind one another all blocks that have been included in the program. Start with the first block <i>'say I'm a cat dancing for 2 seconds'</i>, then run <i>'move 10 steps'</i> then <i>'turn 15 degrees right'</i>, and so on to the last block of the program.
el: Πώς δουλεύει αυτό το πρόγραμμα; Όταν ο χρήστης πατήσει στην πράσινη σημαία εκτελούνται το ένα μετά το άλλο όλες οι εντολές που έχουν εισαχθεί στο πρόγραμμα. Ξεκινάει με την πρώτη εντολή <i>πες 'Είμαι μια γάτα που χορεύει' για 2 δευτερόλεπτα</i>, ύστερα εκτελείται η <i>κινήσου 10 βήματα</i> και τέλος η <i>κινήσου -10 βήματα</i> κ.τ.λ. μέχρι την τελευταία εντολή τουη προγράμματος.
ru: Как работает программа? Когда пользователь нажимает на зелёный флаг, запускаются все блоки, включенные в программу. Начинается с первого блока <i>'say I'm a cat dancing for 2 seconds'</i>, потом исполняется<i>'move 10 steps'</i> потом <i>'turn 15 degrees right'</i>, и так далее до последнего блока программы.

source: Sometimes when we want a set of blocks is constantly repeated, instead of repeating the same blocks over and over again, you can use a repeat instruction allowing achieve the same effect, but more comfortable and manageable way. Consider a couple of examples:
el: Μερικές φορές όταν θέλουμε ένα σύνολο εντολών να εκτελείται συνεχώς επαναλαμβανόμενα, αντί να εισάγουμε το ίδιο σετ εντολών ξανά και ξανά, μπορούμε να χρησιμοποιήσουμε μια εντολή επανάληψης για να καταφέρουμε το ίδιο αποτέλεσμα αλλά με πιο εύκολο αλλά και διαχειρίσιμο τρόπο. Σκεφτείτε τα παρακάτω παραδείγματα:
ru: Иногда, для того чтобы набор блоков повторялся, вместо повтора одних и тех же блоки снова и снова, вы можете использовать блок повтора, что позволяет достичь такого же эффекта, но более удобно в управлении.Рассмотрим несколько примеров:

source: if on edge, bounce
el: εάν βρίσκεσαι στα όρια, αναπήδησε
ru: если касается края, оттолкнуться

source: How these control blocks works?
el: Πώς δουλεύουν αυτές οι εντολές ελέγχου;
ru: Как работает этот блок?

source: In the block <i>'repeat'</i> when execution reaches this point is repeated as often as has been indicated in the parameter block 'repeat', in the example would be 3 times, all blocks included within this block. We can see that the block 'repeat' has an arrow at the bottom indicating that <b>when they finish executing the blocks back again up</b>.
el: Στην εντολή <i>"Επανάλαβε"</i>, όταν η εκτέλεση φτάνει το σημείο αυτό επαναλαμβάνει τόσες φορές όσες υποδεικνύει η παράμετρος, στο παράδειγμα 3 φορές, όλα τα τετράγωνα που περιλαμβάνονται μέσα στην εντολή. Μπορούμε να δούμε ότι το μπλοκ επανάλαβε έχει ένα βέλος στο κάτω μέρος που δείχνει ότι <b>όταν τελειώσουν οι εντολές θα εκτελεστούν και πάλι</b>.
ru: В блоке <i>'repeat'</i> когда исполнение доходит до этого места, то внутри команды выполняются столько раз, сколько указано в параметре 'repeat', в примере 3 раза, повторяются все блоки включенные в это блок. Мы можем видеть что у блока 'repeat' внизу есть стрелка, указывающая, что, <b>when когда команды выполнятся, то блок повторится</b>.

source: The block <i>'forever'</i> works like the 'repeat' but never finish executing the blocks containing in its interior.
el: Η εντολή <i>"για πάντα"</i>, λειτουργεί σαν την «επανάλαβε», αλλά η εκτέλεση των εντολών που περιέχει στο εσωτερικό του δεν τελειώνει ποτέ.
ru: Блок <i>'forever'</i> работает так же как и 'repeat' но никогда не прекращает выполнение включенных в него блоков.

source: Sometimes we don't know previously the number of times you want a set of blocks is executed, as this depends on a given situation. In these cases, the block 'repeat until ...' is really useful. Here's an example:
el: Μερικές φορές δεν γνωρίζουμε από πριν τον αριθμό των φορών που θέλουμε να εκτελεστεί ένα σύνολο εντολών καθώς αυτό μπορεί να εξαρτάται από μια δεδομένη κατάσταση. Σε αυτές τις περιπτώσεις, η εντολή «επανάλαβε ώσπου ...» είναι πραγματικά χρήσιμη. Δείτε το παράδειγμα:
ru: Иногда мы не знаем заранееранее, сколько раз нужен повторить выполнение блоков, поскольку это зависит от ситуации. В этом случае , блок 'repeat until ...' очень полезен. Например:

source: repeat until &lt; touching [Enemy v] ?&gt;
el: επανάλαβε ώσπου &lt;αγγίζει το [Αντίπαλο v]?&gt;
ru: повторять пока не &lt;касается [враг v] ?&gt;

source: say [You don't catch me]
el: Πες [Δεν με πιάνεις]
ru: сказать [Ты меня не поймаешь]

source: say [You catch me]
el: πες [Με έπιασες]
ru: сказать [Ты поймал меня]

source: In the example, the character will constantly repeat the instruction say 'You don't caught me...' while he don't touch the enemy. At the time that the condition is met instruction <i>'repeat until ...'</i>, the contents inside will finish run and will jump to the next instruction, in this case say 'You caught me!'.
el: Στο παράδειγμα, ο χαρακτήρας θα επαναλαμβάνει συνεχώς την εντολή πες "Δεν με πιάνεις", όσο ο ίδιος δεν αγγίζει τον αντίπαλο. Κατά τη στιγμή που η συνθήκη αυτή ισχύσει η εντολή <i>"επανάλαβε ώσπου..."</i>, θα σταματήσει να εκτελεί τα τις περιεχόμενες εντολές και θα μεταβεί στην επόμενη εντολή, σε αυτή την περίπτωση θα πει "Θα μ 'έπιασε!".
ru: В этом примере персонаж повторяет инструкцию говорить'Ты меня не поймаешь...' пока он не касается противника. В момент когдаусловие блока <i>'repeat until ...'</i>, будет выполнен и можно будет перейти к следующему блоку, в данном случае сказать 'Ты поймал меня!'.

source: Instructions related to logical thinking can help your projects are dynamic, <b>so that they behave differently depending on the situation</b>. In the stories, for example, these instructions are not as important as they usually have a linear structure we always want to run the same way, but in other projects, such as video games are essential to perform different actions depending on the situation.
el: Οι εντολές που σχετίζονται με τη λογική μπορούν να βοηθήσουν τα έργα σας να είναι δυναμικά,, <b>δηλαδή να συμπεριφέρονται με διαφορετικό τρόπο ανάλογα με την κατάσταση.</b> Στις ιστορίες, για παράδειγμα, αυτές οι οδηγίες δεν είναι τόσο σημαντικές, δεδομένου ότι συνήθως έχουν μια γραμμική δομή και εκτελούνται με τον ίδιο τρόπο, αλλά σε άλλα έργα, όπως τα βιντεοπαιχνίδια είναι απαραίτητες για να εκτελεστούν διάφορες ενέργειες, ανάλογα με την κατάσταση.
ru: Инструкции, связанные с логическим мышлением, могут помочь вашим проектам быть динамическими, <b>так что герои будут вести себя по-разному в зависимости от ситуации</b>. В историях, например, эти инструкции не так важны, как они, как правило, имеют линейную структуру и выполняются одинаково, но в других проектах, таких как видео игры, важно выполнять разные действия в зависимости от ситуации

source: The most basic block you can start working logical thinking is this:
el: Η πιο βασική εντολή για να αρχίσετε να εργάζεστε στη λογική σκέψη είναι η εξής:
ru: Самый основной блок, с которого вы можете начать работать, - это

source: if &lt; touching color [#0000FF]? &gt;then
el: εάν &lt; άγγιζει χρώμα [#0000FF]?&gt; τότε
ru: если &lt;касается цвета [#0000FF]? &gt; , то

source: say [I have reached the goal!] for (2) secs
el: πες [Έφτασα στον στόχο!] για (2) δευτερόλεπτα
ru: говорить [Я достиг цели!] (2) секунд

source: How this block works? When execution reaches this point, the condition on the block is evaluated, and if this is true, the set of blocks that are within the if executed.
el: Πώς δουλεύει αυτή η εντολή; Όταν η εκτέλεση φτάνει αυτό το σημείο, η συνθήκη στην εντολή υπολογίζεται και αν ισχύει, το σύνολο τον εντολών που περιέχονται στην εάν εκτελούνται.
ru: Как работает этот блок? Когда выполнение достигает этой точки, условие блока проверяется, и если оно верно, то внутренний блок команд выполняется.

source: In the example, if the character is touching the blue color, he says 'I reached the goal.'
el: Στο παράδειγμα, αν ο χαρακτήρας ακουμπάει το μπλέ χρώμα, λέει 'Έφτασα στον στόχο.'
ru: В данном примере, если персонаж касается синего цвета, то он говорит 'I reached the goal.'

source: Now that you know the instructions <i>if</i>, perhaps you can start using blocks <i>if / else</i>, which can be very practical in many types of projects. The blocks <i>if / else</i> are very similar to the block <i>if</i>, but contain two sets of blocks inside.
el: Τώρα που γνωρίζετε την εντολή <i>εάν</i>, ίσως μπορείτε να ξεκινήσετε να χρησιμοποιείτε εντολές <i>εάν τότε / αλλιώς</i>, οι οποίες μπορεί να είναι πολύ πρακτικές σε διάφορα έργα. Οι εντολές <i>ένα τότε/ αλλιώς</i> είναι παρόμοιες με την εντολή <i>εάν</i>, αλλά περιέχουν δύο σύνολα εντολών.
ru: Теперь, когда вы знаете команду <i>if</i>, вы можете начать использовать блок <i>if / else</i>, очень полезный для многих проектов. Блок <i>if / else</i> оень похож на блок <i>if</i>, но содержит команды внутри.

source: if &lt; touching color [#0000FF]? &gt;then
el: εάν &lt; άγγιζει χρώμα [#0000FF]?&gt; τότε
ru: если &lt;касается цвета [#0000FF]? &gt; , то

source: else
el: αλλιώς
ru: иначе

source: How this block works? When execution reaches this point, the condition on the block is evaluated, and if this is true, the set of blocks that are within the 'if' is executed, but if the condition is false, then the set of blocks that are within the 'else' is executed.
el: Πώς δουλεύει αυτή η εντολή; Όταν η εκτέλεση φτάσει αυτό το σημείο, η συνθήκη στην εντολή υπολογίζεται, και αν ισχύει, το σύνολο εντολών που είναι μέσα στο 'εάν' εκτελείται, αλλά αν η συνθήκη είναι ψευδής, τότε το σύνολο εντολών που περιέχετε μέσα στο 'αλλιώς' εκτελείται.
ru: Как работает блок? Когда выполнение подходит к этому месту условик блок проверяется, и если оно верно, то блоки внутри 'if' выполняются, а если условия ложны, то выполняются блоки внутри 'else' .

source: In the example, if the character is touching the blue color, he says 'I reached the goal!', but ,if you are not touching the purple color, says 'I have not reached the goal'.
el: Στο παράδειγμα, αν ο χαρακτήρας αγγίζει το μπλε χρώμα, λέει 'Έφτασα στον στόχο!', αλλά, αν δεν αγγίζει το μπλε χρώμα, λέει 'Δεν έφτασα στον στόχο!'.
ru: В этом примере, если герой коснулся синего цвета, то он говорит 'I reached the goal!', но если он не коснулся нужного цвета, то он говорит 'I have not reached the goal'.

source: To make decisions on some projects sometimes is necessary to evaluate more than one condition at the same time to know what to execute. In these situations it is very helpful to use <b>logical operations</b> that combine the conditions. Logical operations are available in Scratch <i>AND, OR and No</i>.
el: Για να αποφασιστεί η πορεία εκτέλεσης ενός έργου μερικές φορές είναι απαραίτητο να υπολογιστούν παραπάνω από μία συνθήκες ταυτόχρονα. Σε αυτές τις περιπτώσεις βοηθούν πολύ οι <b>λογικοί τελεστές</b> που συνδυάζουν συνθήκες. Τρεις είναι οι λογικοί τελεστές στη Scratch <i>1. και 2.ή 3. δεν ισχύει ότι</i>
ru: Для принятия решений во многих проектах приходится оценивать больше одного условия, чтобы понять, какое действие гужно выполнить. В таких ситуациях очень полезно использовать <b>логические операторы</b> которые комбинируют условия. В Scratch доступны следующие операторы <i>AND, OR и No</i>.

source: if &lt;&lt; touching [Enemy v]? &gt; and &lt;(lives) = [0]&gt;&gt; then
el: εάν &lt;&lt; αγγίζει το [Αντίπαλος v]? &gt; και &lt;(ζωές) = [0]&gt;?gt;τότε
ru: если &lt;&lt;касается [враг v] ?&gt; и &lt;(жизни) = [0]&gt;&gt; , то

source: say [Game over]
el: πες [Τέλος παιχνιδιού]
ru: сказать [Игра закончена]

source: stop [all v]
el: σταμάτησε [όλα v]
ru: стоп [все v]

source: if &lt;&lt; touching [edge v]? &gt; or &lt; touching [Enemy v]? &gt;&gt;then
el: εάν &lt;&lt; αγγίζει το [όρια v]? &gt; ή &lt; αγγίζει το [Αντίπαλος v]? &gt;&gt; τότετότε
eu: balin&lt;&lt; ikutzen []? &gt; bestela &lt; ikutzen []? &gt;&gt;orduan
ru: если &lt;&lt;касается [край v] ?&gt; или &lt;касается [враг v] ?&gt;&gt; , то

source: change [lives v] by (-1)
el: άλλαξε το [lives v] κατά (-1)
eu: aldatu[](-1)-gatik
ru: изменить [жизни v] на (-1)

source: if &lt; not &lt;(level)=(5)&gt;&gt;then
ru: если &lt;не &lt;(уровень) = (5)&gt;&gt; , то

source: say [You still have undiscovered levels] for (2) secs
el: πες [Δεν έχεις ανακαλύψει όλα τα επίπεδα] για (2) δευτερόλεπτα
eu: esan[] (2) segunguz
ru: говорить [У вас все еще есть неоткрытые уровни] (2) секунд

source: The operation <i>AND</i> is true when both conditions are true evaluated. The <i>OR</i> operation is true when one of two conditions are true evaluated. And the operation otherwise not worth the condition, ie, if the condition is true, not returns false and vice versa.
el: Ο τελεστής <i>και</i> δίνει αληθές αποτέλεσμα όταν και οι δύο συνθήκες είναι αληθής. Ο τελεστής <i>ή</i> δίνει αληθές αποτέλεσμα αν τουλάχιστον μία από τις δύο συνθήκες είναι αληθής. Τέλος, ο τελεστής "δεν ισχύει ότι" ισχύει όταν δεν ισχύει η συνθήκη, και δεν ισχύει όταν ισχύει η συνθήκη.
ru: Оператор <i>AND</i> возвращает истину, если оба условия выполняются. Оператор <i>OR</i> возвращает истину, если одно из условий выполняется.

source: In most Scratch creations a certain level of parallelism is required. But what means parallelism? <b>Parallelism is the possibility that several things occur simultaneously.</b> For example, two characters perform an action while a character or do several things at once.
el: Στις περισσότερες δημιουργίες με το Scratch, ένα επίπεδο παραλληλισμού είναι απαραίτητο. Αλλά τι σημαίνει παραλληλισμός; <b>Παραλληλισμός είναι η δυνατότητα πολλών πραγμάτων να συμβαίνουν στον ίδιο χρόνο.</b> Για παράδειγμα, δύο χαρακτήρες εκτελούν κάποια λειτουργία ταυτόχρονα, ή ένας χαρακτήρας κάνει διαφορετικά πράγματα την ίδια χρονική στιγμή.
ru: Для многих проектов необходима параллельность действий. Но, означает параллельность? <b>Параллельность - это возможность того, что некоторые вещи происходят одновременно.</b> Например, два персонажа выполняют действия одновременно или один персонаж делает несколько дел одновременно.

source: The most basic and most obvious way to achieve parallelism is to have several programs that start with <i>'When green flag is clicked'</i>:
el: Ο πιο βασικός τρόπος για την επίτευξη του παραλληλισμού είναι να έχετε αρκετά προγράμματα που ξεκινούν με το <i>'Όταν στην πράσινη σημαία γίνει κλικ'</i>:
ru: Самый распространенный и простой способ добиться параллельности это иметь несколько программ, которые начнут выполняться <i>'When green flag is clicked'</i>:

source: Thus, when the user clicking on the green flag, all programs that start with this block would begin to run simultaneously, or in parallel, as can also be said. You could have several programs that start with this block in the same character, if you want it to do several things at once, or in programs of different characters, if you want everyone to undertake an action at beginning of execution.
el: Έτσι, όταν ο χρήστης πατήσει στην πράσινη σημαία, όλα τα προγράμματα που ξεκινάν με αυτή την εντολή θα εκτελεστούν ταυτόχρονα, ή αλλιώς παράλληλα. Θα μπορούσατε να έχετε αρκετά προγράμματα που ξεκινούν με αυτή την εντολή στον ίδιο χαρακτήρα, αν θέλετε να γίνουν κάποια πράγματα στην ίδια χρονική στιγμή, ή σε προγράμματα σε διαφορετικούς χαρακτήρες αν θέλετε να γίνουν ενέργειες στην αρχή της εκτέλεσης.
ru: Таким образом, когда пользователь нажимает на зеленый флаг, все программы, начинающиеся с этого блока начинают выполняться одновремеено, или параллельно.Вы можете иметь множество программ, которые будут запускаться с этого блока, если вы хотите, чтобы персонаж выполнял несколько действий одновременно, или различные персонажи, если вы хотите, чтобы они одновременно начали участвовать в действии.

source: Another way to achieve parallelism in your program is <b>doing several things occur when the user presses a key or clicks on an object</b>. Consider a couple of examples:
el: Ένας άλλος τρόπος να επιτευχθεί η παραλληλία στα προγράμματά σας είναι <b>να γίνονται διάφορα πράγματα όταν ο χρήστης πατάει κουμπιά στο πληκτρολόγιο ή κάνει κλικ σε αντικείμενα στην οθόνη</b>. Δείτε τα παραδείγματα:
ru: Другой способ добиться параллельности <b>выполнения нескольких дел достигается, если пользователь нажимает клаишу или нажимает на объект</b>. Рассмотрим несколько примеров:

source: when [a v] key pressed
el: Όταν το πλήκτρο [a v] πατηθεί
ru: когда клавиша [A v] нажата

source: say [A] for (2) secs
el: πες [A] για (2) δευτερόλεπτα
eu: [A] esan (2) segunduz
ru: говорить [A] (2) секунд

source: when this sprite clicked
el: Όταν σε αυτό το αντικείμενο γίνει κλικ
eu: Sprite hau sakatzean
ru: когда спрайт нажат

source: if &lt;touching [the mouse pointer v]? &gt; then
ru: если &lt;касается [указатель мыши v] ?&gt; , то

source: turn cw (30) degrees
el: στρίψε δεξιά (30) μοίρες
eu: cw (30) graduz biratu
ru: повернуть вправо на (30) градусов

source: How these blocks works?
el: Πώς δουλεύουν αυτές οι εντολές;
eu: nola egiten dute lan bloke hauek?
ru: Как работают эти блоки?

source: In the first example, we see two different characters that, when a key is pressed, perform a certain action. Therefore, when the user press the a key, in this case, both the cat and the child run at the same time <i>'say A for 2 seconds'</i>
el: Στο πρώτο παράδειγμα, βλέπουμε δύο διαφορετικούς χαρακτήρες που, όταν ένα πλήκτρο πατηθεί, εκτελούν μια λειτουργία. Επομένως, όταν ο χρήστης πατήσει το πλήκτρο a, σε αυτή την περίπτωση, τόσο η γάτα όσο και το παιδί εκτελούν την ίδια στιγμή το <i>'πες Α για 2 δευτερόλεπτα'</i>.
ru: В первом примере мы видим двух героев, которые, когда клавиша нажата, выполняют определенные действия. Например, когда пользователь нажимает клавишу и кошка и ребенок одновременно выполняют <i>'say A for 2 seconds'</i>

source: In the second example we see that a character has two programs that begin with <i>'when clicking this object'</i>. Therefore, when the user clicks on this character, both programs will begin to run simultaneously, in parallel.
el: Στο δεύτερο παράδειγμα βλέπετε ότι ένας χαρακτήρας έχει δύο προγράμματα που ξεκινούν με <i>'όταν σε αυτό το αντικείμενο γίνει κλικ'</i>. Επομένως όταν ο χρήστης κάνει κλικ σε αυτόν τον χαρακτήρα, και τα δύο προγράμματα θα λειτουργήσουν ταυτόχρονα.
ru: Во втором примере мы видим героя, у которого начинаются с <i>'when clicking this object'</i>. Следовательно, когда пользователь щелкнет по этому герою, обе эти программы начнут выполняться одновременно.

source: There are several events more that can achieve parallelism:
el: Υπάρχουν περισσότερα γεγονότα με τα οποία μπορούμε να επιτύχουμε παραλληλισμό:
ru: Есть еще несколько событий, которые могут выполняться одновременно

source: when backdrop switches to [backdrop1 v]
el: Όταν το υπόβαθρο αλλάξει σε [backdrop1 v]
ru: когда фон сменился на [фон1 v]

source: when I receive [message1 v]
el: Όταν λάβω το [message1 v]
eu: nik []jasotzean
ru: когда я получу [сообщение1 v]

source: when [loudness v] &gt; (10)
el: Όταν [ένταση v] &gt; 10
eu: []-an &gt; (10)
ru: когда [громкость v] > (10)

source: when [video motion v] &gt; (2)
el: Όταν [κίνηση στην προβολή από κάμερα v] &gt; (2)
eu: []-an &gt; (2)
ru: когда [видео движение v] > (2)

source: when [timer v] &gt; (45)
el: Όταν [χρονόμετρο v]&gt; (45)
eu: []-an &gt; (45)
ru: когда [таймер v] > (45)
