Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: When you start to programming with Scratch, is very usually to leave the default name of the new characters or scenarios(sprite 1, sprite2, backdrop1, backdrop2 ...). When we have few characters or backdrops, is very easy to know what character or scenario have each name. However, when the number of characters or scenarios increases, it's more complicated. So, is a good practice naming(to recognize easily) each character and scenario of our projects, because our programs can be read more fast. Avoid default names!
ru: Когда натчинаю программировать с помощью Scratch, очень часто отавляют имя по умолчанию для новых персонажей (sprite 1, sprite2, фон1, фон2 ...). Если у вас мало персонажей, то запомнить их имена просто. Однако, когда количество персонажей увеличивается, это становится все сложнее. Поэтому - хорошая практика - давать правильные имена всем персонажам, потому что программу будет легче читать. Избегайте имён по умолчанию!

source: Who we are
el: Ποιοι είμαστε
ru: Кто мы

source: Translations
el: Μεταφράσεις
ru: Перевод

source: Workshops
el: Εργαστήρια
ru: Семинары

source: More thanks
el: Περισσότερα ευχαριστώ
ru: Больше благодарностей

source: Thanks all of you!
el: Σας ευχαριστούμε όλους
ru: Спасибо всем вам!

source: We are so pleased to receive so much help of you and we thought that the best way of show our appreciation is including your work in the website. In this space you can see who people help us to improve Dr. Scratch!
el: Είμαστε στην ευχάριστη θέση να λαμβάνουμε τόση πολλή βοήθεια και σκεφτήκαμε ότι ο καλύτερος τρόπος για να δείξουμε την εκτίμησή μας είναι να συμπεριλάβουμε τη δουλειά σας στον ιστότοπό μας. Σε αυτόν τον χώρο δείτε ποιοι μας βοήθησαν να βελτιώσουμε το Dr .Scratch!
ru: Мы были очень рады получить от вас столько помощи, и мы подумали, что лучший способ показать нашу оценку - это показать ваша работа на веб-сайте. Здесь вы можете видеть всех, кто помог нам улучшить Dr. Scratch!

source: Dr. Scratch's team likes to thank you for your contributions.
el: Η ομάδα του Dr. Scratch θέλει να σας ευχαριστήσει για τη συμβολή σας.
ru: Наша команда рада поблагодарить за ваше участие

source: We know the importance of receiving feedback on your own language to understand every little detail or hint, so we'll translate Dr. Scratch to facilitate coding learning to as many people as possible.
el: Αναγνωρίζουμε τη σπουδαιότητα του να λαμβάνετε ανατροφοδότηση στη γλώσσα σας ώστε να καταλαβαίνετε και τις πιο μικρές λεπτομέρειες και συμβουλές, έτσι θα μεταφράσουμε το Dr. Scratch για να διευκολύνουμε την εκμάθηση του προγραμματισμού σε όσους περισσότερους ανθρώπους μπορούμε.
ru: Мы помним о том, как важно получать ответную реакцию на родном языке чтобы понимать все детали и подсказки. Поэтому мы перевели Dr. Scratch чтобы облегчить изучение программированию для как можно большего числа людей.

source: Would you like help us to translate Dr. Scratch to your language? Many people have already helped us!
el: Θέλετε να μας βοηθήσετε να μεταφράσουμε το Dr. Scratch στη δική σας γλώσσα; Πολλοί μας βοήθησαν ήδη!
ru: Хотите помочь нам перевести Dr.Scratch на свой язык? Многие уже помогли нам!

source: We are collaborating with several schools where we can prove the website with children and see which features they need.
el: Ευχαριστούμε τα σχολεία που μας φιλοξένησαν και είδαμε τον ιστότοπό μας με μαθητές και ποια χαρακτηριστικά χρειαζόντουσαν.
eu: Eskola askorekin lan egiten dugu, non haurrekin webgunea proba dezakete eta beraien beharrak aztertu.
ru: Мы сотрудничаем с несколькими школами, улучшая веб сайт со школьниками, чтобы понять какие средства им нужны.

source: Thanks all of children and teachers who help us with the development!
el: Ευχαριστούμε όλα τα παιδιά και τους εκπαιδευτικούς που μας βοήθησαν στην ανάπτυξη!
eu: Eskerrik asko garatzen lagundu gaituzuen haur eta irakasle guztiei
ru: Спасибо всем детям и преподавателям, которые помогают нам в разработке

source: <strong>More thanks</strong></h2>
el: <strong>Περισσότερες ευχαριστίες</strong></h2>
eu: <strong>Eskerrik asko</strong></h2>
ru: <strong>Еще благодарности</strong>

source: Why?
el: Γιατί;
eu: Zergatik?
ru: Почему?

source: How?
el: Πώς;
eu: Nola?
ru: Как?

source: Working on
el: Έρχονται σύντομα
eu: Lanean
ru: Над чем работаем

source: Contact us
el: Επικοινωνία
eu: Harremanetan jarri
ru: Свяжитесь с нами

source: Organizations
el: Οργανισμοί
eu: Erakundeak
ru: Организации

source: Sign up
el: Εγγραφείτε
eu: Izena eman
ru: Зарегистрироваться

source: I forgot my password
el: Ξέχασα τον κωδικό μου
eu: Pasahitza ahaztu dut.
ru: Я забыл пароль

source: Analyze your Scratch projects
el: Αναλύστε τα έργα Scratch
eu: Aztertu zure Scratch proiektuak
ru: Анализируйте свои Scratch проекты

source: Welcome to the Dr. Scratch website, an analytical tool that evaluates your Scratch projects in a variety of computational areas. This analyzer is a helpful tool to evaluate your own projects, or those of your Scratch students.
el: Καλωσήρθατε στον ιστότοπο του Dr. Scratch, ενός αναλυτικού εργαλείου που αξιολογεί τα έργα Scratch σε ένα πλήθος περιοχών υπολογιστικής σκέψης. Αυτό το εργαλείο βοηθάει στην αξιολόγηση των έργων σας και των έργων των μαθητών σας.
eu: Ongi etorri Dr. Scratch-en webgunera, analisirako tresna zeinak zure Scratch proiektuak konputazio eremuetan ebaluatzen ditu. Analizatzaile honek zure proiektuak edo zure ikasleen proeiktuak ebaluatzeko laguntza tresna da.
ru: Добро пожаловать на сайт Dr. Scratch, аналитический инструмент, который оценивает вашипроекты по многим показателям. Этот аналитический инструмент - будет полезен и для анализа вашихз проектов и для анализа проектов ваших студентов.

source: WHY?
el: ΓΙΑΤΙ;
eu: ZERGATIK?
ru: ПОЧЕМУ?

source: Why
el: Γιατί
eu: Zergatik
ru: Почему

source: you’ll love Dr. Scratch
el: θα αγαπήσετε το Dr. Scratch
eu: Dr. Scratch maitatuko duzu
ru: вам нравится Dr. Scratch

source: A powerful tool to analyze your Scratch projects
el: Ένα εργαλείο ανάλυσης έργων Scratch
eu: Tresna indartsu bat zure Scratch proiektua aztertzeko
ru: Мощный инструмент для анализа ваших проектов Scratch

source: Simple & Fun
el: Απλό και Διασκεδαστικό
eu: Erraza & Dibertigarria
ru: Простой и Забавный

source: Your students can easily learn how to improve their programming skills in a fun way.
el: Οι μαθητές σας μπορούν εύκολα να μάθουν πώς να βελτιώσουν τις προγραμματιστικές τους δεξιότητες με διασκεδαστικό τρόπο.
eu: Zure ikasleak erraz ikasi dezakete nola hobeto beraien programazioarentrebetasunak modu dibertigarri batean
ru: Ваши ученики могут легко узнать, как улучшить свои навыки программирования в веселой форме.

source: Improve your skills
el: Βελτιώστε τις δεξιότητές σας
eu: Zure gaitasunak hobetu
ru: Улучшайте свои навыки

source: We provide feedback on several aspects which are related to Computational Thinking.
el: Παρέχουμε ανατροφοδότηση σε διάφορες πτυχές της Υπολογιστικής Σκέψης.
eu: Dr. Scratch-ek iritzia eskaintzen du erlazionatutako alderdietan pentsamendukomputazionalarekin hobetzen laguntzeko
ru: «Мы предоставляем отзывы по нескольким аспектам, связанным с вычислительным Мышлением.

source: Always improving
el: Το εργαλείο βελτιώνεται συνεχώς
eu: Beti hobetzen
ru: Постоянные улучшения

source: We're continually enhancing the features of Dr. Scratch, and we'd love to hear your thoughts
el: Συνεχώς αυξάνουμε τα χαρακτηριστικά του Dr. Scratch, και θα θέλαμε να ακούσουμε τις σκέψεις σας.
eu: Hobetzen saiatzen gara etengabe, hori dela eta, zure iritzia entzuteagustatuko litzaiguke
ru: Мы постоянно улучшаем of Dr. Scratch, и хотим услышать ваши пожелания

source: How
el: Πώς
eu: Nola
ru: Как

source: How
el: Πώς
eu: Nola
ru: Как

source: it works
el: δουλεύει
eu: funtzionatzen du
ru: это работает

source: There are two options to analyze a Scratch project with Dr. Scratch
el: Υπάρχουν δύο επιλογές για να αναλύσετε ένα έργο με το Dr. Scratch
eu: Dr. Scratch-ek bi aukera ematen dizkigu proiektua aztertzeko
ru: Есть две возможности анализировать Scratch проекты с Dr. Scratch

source: You can upload an sb2 file or just provide the project url, avoiding the need to previously download the project to your computer. By analyzing your projects with Dr. Scratch, you can easily check your Computational Thinking Score.
el: Μπορείτε να ανεβάσετε ένα sb2 αρχείο ή απλώς να δώσετε το url του έργου στην κοινότητα του Scratch, χωρίς προηγουμένως να κατεβάσετε το έργο στον υπολογιστή σας. Αναλύοντας τα έργα σας με το Dr. Scratch, μπορείτε νε δείτε το Σκορ σας στην Υπολογιστική Σκέψη.
eu: Fitxategi luzapen sb2 bat igo dezakezu edo url erabili, Scratch-ek erraztenproiektua zure ordenagailura jeisteko beharrik gabe. Dr Scratc aztertutajakin dezakezu zailtasunik gabe zure pentsamendu komputazionalaren maila
ru: Мы можете загрузить sb2 файл своего проекта или указать его url, чтобы избежать необходимости скачивать файл на свой компьютер. Анализирую свои проекты с Dr. Scratch, вы легко можете оценить навыки Вычислительного Мышления в очках.

source: It is extremely easy to use, both for begginers and expert programmers.
el: Είναι πολύ εύκολο στην χρήση, τόσο για αρχάριους όσο και για έμπειρους προγραμματιστές.
eu: Oso erraza da erabiltzea, hasiberri bat bazara edo programatzaile aditu bat bazara
ru: Это очень просто и для начинающего и для эксперта

source: You receive feedback to improve your coding skills.
el: Λαμβάνετε ανατροφοδότηση για να βελτιώσετε τις προγραμματιστικές σας ικανότητες.
eu: Realimentazioa jasoko duzu zure programazio trebetasunak hobetzeko
ru: Вы получите обратную связь для улучшения навыков программирования

source: You can keep on improving your programming skills by yourself even from home.
el: Μπορείτε να βελτιώνετε τις προγραμματιστικές σας ικανότητες ακόμη και από το σπίτι.
eu: Zure trebetasunak hobetzen jarraitu dezakezu, zuk zeure programatzailegisa edo etxetik
ru: Вы можете работать над улучшением своих навыков самостоятельно

source: You can track your progress through charts and stats.
el: Μπορείτε να παρακολουθείτε την πρόοδό σας μέσω γραφημάτων και στατιστικών.
eu: Zure hobekuntzen jarraipen bat egin dezakezu, grafiko eta estadistikenbidez
ru: Вы можете отслеживать свой прогресс в графиках и статистических данных

source: NEW FEATURES
el: ΝΕΑ ΧΑΡΑΚΤΗΡΙΣΤΙΚΑ
eu: Ezaugarri berriak
ru: НОВЫЕ ВОЗМОЖНОСТИ

source: Soon
el: Σύντομα
eu: Ezaugarriak
ru: Скоро

source: We are working on new features to improve Dr. Scratch
el: Δουλεύουμε σε νέα χαρακτηριστικά για να βελτιώσουμε το Dr. Scratch
eu: Ezaugarri berriekin lanean ari gara, Dr. Scratch hobetzeko
ru: Мы работаем над новыми возможностями в Dr. Scratch

source: Multilingual website
el: Ιστότοπος σε πολλές γλώσσες
eu: Webgune eleanitza
ru: Многоязычный Веб-сайт

source: Teacher accounts
el: Λογαριασμοί εκπαιδευτικών
eu: Irakasleentzako kontua
ru: Учительский доступ

source: Teachers will be able to group (and follow) their students to keep track of their progress in a fast and simple way.
el: Οι εκπαιδευτικοί θα μπορούν να δημιουργήσουν και να παρακολουθούν ομάδες μαθητών ώστε να έχουν μια καταγραφή της προόδου τους με απλό και γρήγορο τρόπο.
eu: Irakasleak beraien ikasleak bildu (eta jarraitu) ahal izango dute, eta horrelaberaien aurrerapenen jarraipen bat egin modu azkar eta erraz batean
ru: Учителя смогут отслеживать прогресс группы своих учеников быстро и просто

source: Cloud platform
el: Η πλατφόρμα στο σύννεφο
eu: Hodeietako plataforma
ru: Облачная платформа

source: We are in the process of migrating our servers to the Cloud with the aim of providing a better performance.
el: Είμαστε στην διαδικασία μεταφοράς των εξυπηρετητών μας στο Σύννεφο με σκοπό την καλύτερο απόδοση.
eu: Hodeietara migratzen ari gara gure zerbitzaren errendimendu hobe bateskeintzeko asmoarekin
ru: Наши серверы переместятся в Облакои будут работать еще лучше.

source: With Dr. Scratch plug-ins for Chrome and Firefox, students will analyze their project WHILE programming on the Scratch website.
el: Με τα πρόσθετα για τον Chrome και τον Firefox, οι μαθητές μπορούν να χρησιμοποιούν το Dr. Scratch για να αναλύουν τα έργα τους ΕΝΩ προγραμματίζουν στον ιστότοπο του Scratch.
eu: Chrome eta Firefox-eko Dr. Scratch-en pluginsekin, ikasleak beraien proiektuakaztertu ahal izango dituzte beraien proiektuak, Scratch-eko webguneaprogramatzen duten BITARTEAN.
ru: Dr. Scratch плагины для Chrome and Firefox, помогут ученикам анализировать свои проекты в ходе работы на сайте Scratch.

source: Gamification
el: Παιχνιδοποίηση
eu: Gamifikazioa
ru: Игрофикация

source: We'd like to take learners curiosity one step further. Do you have cool ideas to gamify our platform?
el: Θα θέλαμε να πάμε την περιέργεια των μαθητών ένα βήμα παραπέρα. Έχετε ιδέες για το πώς να μετατρέψουμε την πλατφόρμα μας σε ένα παιχνίδι;
eu: Ikasleen jakinmina motibatzea gustatuko litzaiguke. Ideia interesanteak ahaldituzu gure plataformak gamifikatzeko?
ru: Мы хотели бы еще больше привлечь внимание учащихся к дальнейшему шагу. Нет ли у вас идей по игрофикации платформы?

source: Social network
el: Κοινωνική δικτύωση
eu: Sare soziala
ru: Социальная сеть

source: The new social network funcionalities will allow users to communicate with each other to exchange ideas and challenges.
el: Οι νέες δυνατότητες κοινωνικής δικτύωσης θα επιτρέψουν στους χρήστες να επικοινωνούν μεταξύ τους για να ανταλλάσσουν ιδέες και προκλήσεις.
eu: Sare sozialean gehituko ditugun funtzionalitateak, erabiltzaileen arteankomunikatzeko eta ideak eta erronkak trukatzeko aukerako emango die
ru: Функции социальной сети помогут участникам общатьсяи обмениваться идеями.

source: Contact
el: Επικοινωνία
eu: Kontaktua
ru: Контакты

source: <strong>Contact </strong> Dr. Scratch team</h2>
el: <strong>Επικοινωνήστε</strong> με την ομάδα του Dr. Scratch </h2>
eu: <strong>Kontaktatu </strong> Dr. Scratc-eko taldea</h2>
ru: <strong>Контакты </strong> Dr. Scratch команды</h2>

source: We would be pleased to receive your feedback
el: Στείλτε μας την γνώμη σας
eu: Gustatuko litzaiguke zure iritzia eta ideia berriak entzutea
ru: Нам будет приятно получить отзыв

source: We would like to thank many people for their collaboration and we have done one special section.
el: Πολλοί συμμετείχαν στην προσπάθειά μας και κάναμε μια ενότητα για να τους ευχαριστήσουμε.
eu: Jende askori bere kolaborazioa eskertzea gustatuko litzaiguke eta, horretarakoatal berezi bat ipini dugu
ru: Нам приятно поблагодарить людей за их вклад и мы создвлиспециальный раздел.

source: Collaborators
el: Συνεργάτες
eu: Kolaboratzaileak
ru: Сотрудники

source: Blog
eu: Bloga
ru: Блог

source: Are you a Dr. Scratch user?
el: Είστε χρήστης του Dr. Scratch;
eu: Dr. Scratc-eko erabiltzailea zara?
ru: Вы пользователь Dr. Scratch?

source: Join now!
el: Εγγραφείτε τώρα!
eu: Probatu ezazu!
ru: Вступайте прямо сейчас!

source: It's easy -and free- sign up an account in Dr. Scratch
eu: Erraza eta doainkoa da Dr. Scratc-eko kontu bat egitea
ru: Это так просто - получить бесплатный аккаунт Dr. Scratch

source: Choose a Dr. Scratch Username
eu: Aukeratu erabiltzaile izen bat Dr. Scratch-en
ru: Выберите имя пользователя

source: Choose a Password
el: Αλλάξτε κωδικό
eu: Aukeratu pasahitza
ru: Выберите пароль

source: Confirm Password
el: Επιβεβαιώστε τον κωδικό:
eu: Pasahitza berretsi
ru: Подтвердите пароль

source: If you are minor of 16, enter your parent's or guardian's email address and we will send them an email to confirm this account.
eu: Adin txikikoa izan ezgero zure guraso edo tutorearen posta jarri eta guk bidaliko diogu kontua baieztatzeko posta.
ru: Если вам меньше 16 то укажите почту родителей или опекуна и мы пошлем подтверждение на его почту.

source: Email address
eu: Posta helbidea
ru: Адрес почты

source: Parent's or guardian's email address
eu: Guraso edo tutoreen posta helbidea
ru: Почта родителя или опекуна

source: Confirm email address
eu: Berretsi posta helbidea
ru: Подтвердить адрес

source: Your responses to these questions will be kept private.
eu: Hurrengo galderen erantzunak probatuki gordeko dira.
ru: Ваши ответы на эти вопросы будут сохранены в тайне

source: Why do we ask for this info?
eu: Zergatik hurrengoa galdetzen dugu?
ru: Почему мы об этом спрашиваем?

source: Birth Month and Year
ru: Месяц и Год Рождения

source: We use this information to calculate the age range of people who use Dr. Scratch, and to confirm that you are the owner of the account if you contact us. Your birth month and year will not be made public.
ru: Мы используем эту информацию для вычисления различия в возрасте людей использующих Dr. Scratch, и дя подтверждения того, что это ваш аккаунт, если вы обратитесь к нам. Ваш месяц и год рожденья не будут доступны остальным.

source: Gender
ru: Пол

source: This helps the Dr. Scratch design team understand who is using Dr. Scratch, and provides information that helps us broaden participation. This information is not visible on your account, and is only used to describe overall participation.
ru: Эта информация помогает понять, кто использует Dr. Scratchи обеспечить качественную поддержку. Эта не будет видна в вашем аккаунте и описывает только общее участие.

source: - Month -
ru: - Месяцы

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: May
ru: Май

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: - Year -
ru: - Год -

source: Male
ru: Мужской

source: Female
ru: Женский

source: Country
ru: Страна

source: - Country -
ru: - Страна -

source: Step 1
eu: 1. urratsa
ru: Шаг 1

source: Step 2
eu: 2. urratsa
ru: Шаг 2

source: Step 3
eu: 3. urratsa
ru: Шаг 3

source: Step 4
eu: 4. urratsa
ru: Шаг 4

source: These statistics are update every night at 00.00h CEST.
eu: Estatistika hauek gauero eguneratzen dira, 00.00h CEST-tan.
ru: Эта статистика обновляется каждую ночь в 0 часов

source: <h3 class='text-left dark-text'>The level of your project is... <strong> MASTER! </strong></h3>
el: <h3 class='text-left dark-text'>Το επίπεδό σας είναι... <strong>MASTER! </strong></h3>
eu: <h3 class='text-left dark-text'>Zure proiektuaren maila ... <strong> AURRERATUA da! </strong></h3>
ru: <h3 class='text-left dark-text'>Уровень вашего проекта... <strong> Мастер! </strong></h3>

source: New organization in Dr. Scratch!
el: Νέος οργανισμός στο Dr. Scratch!
eu: Erakunde berria Dr. Scratch-en!
ru: Новые организации в Dr. Scratch!

source: You're receiving this email because you have successfully signed up in Dr. Scratch for organizations.
el: Λαμβάνετε αυτό το email γιατί εγγραφήκατε επιτυχώς στο Dr. Scratch για οργανισμούς.
eu: Zuk posta hau jaso duzu erakundeetako Dr. Scratch-en izen ematea egoki bete delako.
ru: Вы получили это письмо, потому что успешно зарегистрировались в Dr. Scratch для организаций.

source: Do you want to analyze many projects?
eu: Zuk proiektu asko aztertu nahi dituzu?
ru: Хотите анализировать больше проектов

source: You can analyze at the same time all the Scratch proyects of your students!
el: Μπορείτε να αναλύετε τα έργα των μαθητών σας και τα δικά σας!
eu: Zuk aztertu dezakezu momentu berean zure ikasleen proiektu guztiak.
ru: Вы можете одновременно анализировать все проекты своих учеников

source: Only you have to put a
el: Απλά εισάγετε ένα
eu: Bakarrik zuk jarri behar duzu
ru: Все что вам нужно, это загрузить

source: file CSV
el: αρχείο CSV
eu: CSV fitxategia
ru: файл CSV

source: with the urls of the Scratch projects you want to analyze:
el: με τα url των έργων που θέλετε να αναλύσετε:
eu: Aztertu nahi duzun Scratch proiektuaren URL:
ru: c urls Scratch проектов, которые вы хотитет анализировать:

source: <input name='csvFile' type='file' class='filestyle' data-buttonText='Choose File .csv'>
el: <input name='csvFile' type='file' class='filestyle' data-buttonText='Επιλέξτε .csv αρχείο'>
ru: <input name='csvFile' type='file' class='filestyle' data-buttonText='Выбрать File .csv'>

source: Analyze my projects
el: Ανάλυσε τα έργα μου
eu: Nere proiektua aztertu
ru: Анализировать мои проекты

source: Remember me
el: Θυμήσου με
eu: Gogora nazazu
ru: Запомнить меня

source: Dr. Scratch for organizations
el: Dr. Scratch για Οργανισμούς
eu: Erakundeetarako Dr. Scratch
ru: Dr. Scratch для организаций

source: Welcome to the organizations version of Dr. Scratch
el: Καλωσήρθατε στην έκδοση του Dr. Scratch για οργανισμούς
eu: Ongi etorri Dr.Scratch-en erakundeetarako bertsiora
ru: Добро пожаловать в Dr. Scratch для организаций

source: Dr. Scratch for organizations is an analytical tool that can help you evaluate the Scratch projects of the students participating in your initiatives to asses their progression in terms of coding and computational thinking skills.
el: Το Dr. Scratch για οργανισμούς είναι ένα αναλυτικό εργαλείο που βοηθάει την αξιολόγηση έργων Scratch μαθητών που συμμετέχουν στις δράσεις του οργανισμού και αξιολογεί την πρόοδό τους με βάση τις δεξιότητες προγραμματισμού και υπολογιστικές σκέψης που αναπτύσσουν.
eu: Erakundeetarako Dr. Scratch analisirako tresna da, ikasleek beraien Scratch proiektuen bidez zure ekimenetan parte hartuz, beraien lana ebaluatu eta programazio eta konputazio kontzeptuetan beraien aurrerapena ikus daiteke.
ru: Dr. Scratch для организаций - это аналитический инструмент, который может помочь вамоценить проекты Scratch студентов, участвующих в вашихинициативах по оценке их прогресса с точки зрения кодирования и навыковвычислительного мышления.

source: Sign up!
el: Εγγραφείτε!
eu: Izena eman!
ru: Зарегистрироваться

source: to join Dr. Scratch for organizations?
el: να εγγραφείτε στο Dr. Scratch για οργανισμούς;
eu: Dr. Scratch taldera elkartzeko?
ru: присоединиться к Dr. Scratch для организаций?

source: Would you like to be one of the 10 first organizations testing this new feature? Just drop us a line at
el: Θα θέλατε να είστε ένας από τους δέκα πρώτους οργανισμούς που θα δοκιμάσουν αυτό το νέο χαρακτηριστικό; Ενημερώστε μας στο
eu: Gustatuko litzaizuke lehen 10 erakundeetakoa izaten ingurune berria probatzen? askatu hurrengo lerroan
ru: Хотели бы вы стать одной из 10 первых организаций, тестирующих эту новуювозможность? Просто напишите нам

source: and we'll send you a hash key that will allow you to sign up in the web
el: και θα σας στείλουμε ένα κλειδί με το οποίο θα εγγραφείτε μέσω διαδικτύου
eu: Guk gakoa bidaliko dizugu, horrekin webgunean sartzeko baimena izango duzu
ru: и мы отправим вам хэш-ключ, который позволит вам зарегистрировать в Интернете

source: Organization's name
el: Όνομα οργανισμού
eu: Erakunde izena
ru: Название организации

source: Hashkey
el: Κλειδί
eu: Gakoa
ru: Хеш-ключ

source: This username already exists. Choose another, please.
el: Αυτό το όνομα υπάρχει ήδη. Παρακαλώ επιλέξτε άλλο.
eu: Erabiltzaile-izen hori beste batek erabiltzen du. Mesedez, beste bat aukeratu.
ru: Это имя уже занято. Выберите другое, пожалуйста

source: This hashkey does not exist. Choose another, please.
eu: Gako hori ez da existitzen. Mesedez, erabili beste bat.
ru: Это хеш-ключ не существует. Выберите другой, пожалуйста.

source: Reset password
el: Επαναφορά κωδικού
eu: Pasahitza berrezarri
ru: Сбросить пароль

source: You're receiving this email because you requested a password reset for your user account at Dr. Scratch.
el: Λαμβάνετε αυτό το email επειδή ζητήσατε επαναφορά κωδικού του λογαριασμού σας στον ιστότοπο του Dr. Scratch.
eu: Zuk posta hau jaso duzu, zure Doctor Scratch-eko pasahitza berezartzeko eskatu duzulako.
ru: Вы получаете это электронное письмо, потому что вы запросили сброс пароля для своего аккаунта в Dr. Scratch.
