Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: This Scratch project draws two orange lines of different length on the screen. Rather than repeat the code 2 times, as shown in the example, you can define a <i>'DrawOrange'</i> block consisting of blocks that paint an orange line on the screen and that you can tell what is the length of the line. For this you go to the category 'More Blocks' and press the Create button a block:
el: Αυτό το πρόγραμμα ζωγραφίζει δύο πορτοκαλί γραμμές διαφορετικού μήκους στην οθόνη. Αντί να επαναλάβουμε τον κώδικα 2 φορές, όπως φαίνεται στο παράδειγμα, μπορείτε να ορίσετε μια εντολή <i>'Ζωγράφισε πορτοκαλί'</i> που θα αποτελείται από εντολές που ζωγραφίζουν μια πορτοκαλί γραμμή στην οθόνη και που θα μπορούμε να ορίσουμε το μήκος της γραμμής. Για αυτό πηγαίνετε στην κατηγορία 'Άλλες Εντολές' και επιλέξτε 'Δημιουργήστε ένα τετράγωνο εντολών':
eu: Scratcheko proiektu honek bi lerro laranja marrazten ditu luzera desberdinekoak pantailan. Kodea bi aldiz errepikatu beharrean, adibidean ikusten dugun bezala, posible da bloke bat <i>'PintaNaranja'</i> definitzea pantailan marraztutako lerro laranja eta lerroaren luzera adierazi daitekena.Horretarako 'bloke gehiago' kategorira joan behar da eta sortu bloke bat botian sakatu:
ru: Этот проект Scratch рисует две оранжевые линии разной длины на экране. Вместо повторения кода 2 раза, как показано в примере, вы можете определить<i>'DrawOrange'</i> блок, состоящий из блоков, рисующих оранжевые линии на экране с длиной, которую вы можете задать Для этого вы можете выбрать 'Другие блоки' и нажать Создать блок:

source: define PaintedOrange(length)
el: ορισμός του ΖωγράφισεΠορτοκαλί(μήκος)
eu: define LaranjazMargotu(luzeera)
ru: определить Окрашенныйворанжевыйцвет(длина)

source: move (length) steps
el: κινήσου (μήκος) βήματα
eu: (luzeera) pausu mugitu
ru: идти (длина) шагов

source: Having defined the block <i>'DrawOrange'</i> it can be used in any program of the project, as we see below:
el: Έχοντας ορίσει την εντολή <i>'ΖωγράφισεΠορτοκαλί'</i> μπορεί να χρησιμοποιηθεί στο πρόγραμμα, όπως φαίνεται παρακάτω:
eu: <i>'LaranjazMarraztatutako'</i> blokea definituta izan da, bera beste proiektutako programetan erabili daiteke, behean ikesten den moduan:
ru: После того как блок <i>'DrawOrange'</i> будет определен, его можно будет использовать в любом месте проекта, как показано ниже:

source: PaintedOrange(100):: looks stack
el: ΖωγράφισεΠορτοκαλί(100):: looks stack
eu: LaranjazMargotutakoa(100):: pila begiratu
ru: Окрашенныйворанжевыйцвет(100):: looks stack

source: PaintedOrange(200):: looks stack
el: ΖωγράφισεΠορτοκαλί(200):: looks stack
eu: LaranjazMargotutakoa(200):: pila begiratu
ru: Окрашенныйворанжевыйцвет(200):: looks stack

source: In this way, we avoid repeating code, which makes our projects easier to program and maintain. As can be seen, the first time the block is used <i>DrawOrange</i> prompted a length of 100 steps, whereas the second time length is 200 steps.
el: Με αυτόν τον τρόπο, αποφεύγουμε επαναλαμβανόμενο κώδικα, κάνοντας τα έργα μας ευκολότερα στον προγραμματισμό και την συντήρηση. Όπως είδατε, την πρώτη φορά που η εντολή <i>ΖωγράφισεΠορτοκαλί</i> καλείται το μήκος είναι 100 βήματα, ενώ την δεύτερη φορά το μήκος είναι 200 βήματα.
eu: Kodea errepikatzea sahiestu behar dugu, horrekin gure proiektuak programatzea eta mantentzea errezagoa izango da. Ikusi daitekeenez, lehen blokean, laranjaz marraztutakoan, 100 pausuko luzeera du, eta bigarrenean 200-ekoa.
ru: Таким образом, мы избежали повторения кода и это делает проект проще для программирования и поддержки. Как показано, в первый раз в блоке используется <i>DrawOrange</i> длина 100 шагов, а во второй раз200 шагов.

source: If you get 2 points...
el: Αν πήρατε δύο βαθμούς...
eu: 2 puntu baldin badituzu ...
ru: Если вы набрали 2 очка

source: In some Scratch projects we have many identical characters that exactly perform the same actions. The first idea that comes to mind to do this is to create a character, schedule all his behavior and once you're ready, make as many copies as you need. Therefore, if we want 20 Martians, create 20 identical objects. However, what if I want to change the program? Would have to go object by object performing this modification.
el: Σε μερικά έργα Scratch έχουμε αρκετούς ίδιους χαρακτήρες που κάνουν ακριβώς τις ίδιες ενέργειες. Η πρώτη σκέψη που έρχεται στο μυαλό είναι να δημιουργήσουμε έναν χαρακτήρα, να τον προγραμματίσουμε και όταν είμαστε έτοιμοι, να κάνουμε όσα αντίγραφα μπορούμε. Επομένως αν χρειαζόμαστε 20 Αρειανούς, δημιουργούμε 20 αντίγραφα. Όμως, τι θα γίνει αν θελήσουμε μια αλλαγή στο πρόγραμμα. Θα πρέπει να πάμε σε κάθε ένα αντικείμενο να κάνουμε την αλλαγή.
eu: Scratch-eko proiektu batzuetan, pertsonai asko ditugu ekintza berdina egiteko. Burura datorkigun lehen ideia litzake pertsonai bat sortzea eta bere jarrera guztiak zerrendatzea eta prest dagonean bere kopiak egin. 20 martetar behar izanez gero, bat sortu eta 20 kopia burutu. aldaketak egin nahi izanez gero, objetu nagusira joan eta han egin beharko ditugu.
ru: Во многих проектах Scratch projects мы видим персонажей, которые выполняют одинаковые действия. Первая идея, которая приходит в голову - это создать персонаж, расписать все его действия и после этого, сделать столько копий, сколько нужно. Следовально, если нужно 20 марсиан, нужно создать 20 одинаковых объектов. А что делать, если я захочу внести изменеие в программу? Придется переходить из объекта в объект и вносить изменения.

source: For such situations it is preferable to use <b>clones</b>, a type of abstraction that helps us to program a single object, and dynamically <b>create exact copies with the same behavior.</b>
el: Σε αυτές τις περιπτώσεις είναι προτιμότερο να χρησιμοποιήσουμε <b>κλώνους</b>, έναν τύπο αφαίρεσης που μας βοηθάει να προγραμματίσουμε ένα αντικείμενο και δυναμικά να <b>δημιουργήσουμε ακριβή αντίγραφα με την ίδια συμπεριφορά.</b>
eu: Egoera bakoitzerako egokiena <b>klonak</b> erabiltzea da, objetu bakarrak programatzeko lagun gaitzakeen abstrakzio mota, eta diamikoki <b>jarrera bera dutek kopia zehatzak sortu.</b>
ru: Ддя таких ситуаций предпочтительно использовать <b>клоны</b>, тип абстракции, которая позволяет создавать одииночные объекты и динамические <b>создавать точные копии с тем же самым поведением.</b>

source: Let's see how it works with an example. Imagine you want to pretend that it is snowing on a project. We can draw an object that is a snowflake, and once you start implementing the project, constantly be creating clones appear at the top of the screen and they will fall to the bottom:
el: Ας δούμε πώς δουλεύει με ένα παράδειγμα. Φανταστείτε ότι θέλετε να "χιονίσει" σε ένα έργο. Μπορούμε να σχεδιάσουμε μια χιονονιφάδα, και μόλις αρχίσουμε να υλοποιούμε το έργο, συνεχώς να δημιουργούμε κλώνους να εμφανίζονται στην οθόνη και να πέφτουν προς τα κάτω:
eu: Ikusi nola lan egin adibide batekin. Imagina ezazu zure proiektuan elurra egitea nahi dezula. Marraztu dezakezu objetu bat elur maluta dena, eta hasi inplementatzen proiektua eta klonak sortu.
ru: Давайте посмотрим, как это работает с примером. Представьте, что вы хотите имитироватьснегопад в проекте. Мы можем нарисовать одну снежинку, которая при разработаке проекта, постоянно будет создавать свои клоны в верхней части экрана и эти клоны будут падать на дно экрана:

source: forever
el: για πάντα
eu: betirako
ru: повторять всегда

source: create clone of [myself v]
el: δημιούργησε κλώνο [του εαυτού μου v]
eu: [ni neu] klonatu
ru: создать клон [себя v]

source: wait (0.2) secs
el: περίμενε (0.2) δευτερόλεπτα
eu: itxaron (0,2) segundu
ru: ждать (0.2) секунд

source: go to x:(pick random(-200) to (200)) y:(200)
el: πήγαινε στη θέση x:(επίλεξε έναν τυχαίο αριθμό από το (-200) μέχρι το (200)) και y:(200)
eu: x:((-200):(200)arteko ausazko balioa) y:(200) (e)ra joan
ru: перейти в x: (выдать случайное от (-200) до (200)) y: (200)

source: glide (3) secs to x:(x position) y:(-180)
el: πήγαινε αργά για (3) δευτ. στη θέση x: (θέση του x) και y: (-180)
eu: (3) segundotan x:(x posizioa) y:(-180) (e)ra
ru: плыть (3) секунд в точку x: (положение x) y: (-180)

source: delete this clone
el: διάγραψε αυτόν τον κλώνο
eu: klon haubezabatu
ru: удалить клон

source: Thus, just by programming a character, we can have infinite clones which are created at a particular time of project implementation and are deleted when they are no longer needed.
el: Έτσι, με το να προγραμματίζουμε μόνο έναν χαρακτήρα, μπορούμε να έχουμε άπειρους κλώνους που δημιουργούντα σε συγκεκριμένη χρονική στιγμή και διαγράφονται όταν δεν χρειάζονται.
ru: Так, программируя только один персонаж, мы можем создать клоны которые создаются в проекте в нужное время и удаляются, когда они больше не нужны.

source: Data Representation
el: Αναπαράσταση δεδομένων
eu: Datu adierazlea
ru: Представление данных

source: Every Scratch project needs a set of information about the characters in order to run properly. For example, <b>we need to know the position of each character, the direction it is pointing, size, etc.</b> In addition, programmers can create new information repositories to store other data such as the level at which we find ourselves, elapsed time, the rating, the lives, the rewards collected ...
el: Κάθε έργο Scratch χρειάζεται ένα σύνολο πληροφοριών σχετικά με τους χαρακτήρες για να τρέχει σωστά. Για παράδειγμα, <b>θα πρέπει να ξέρουμε τη θέση κάθε χαρακτήρα, την κατεύθυνσή του, το μέγεθός του κ.α.</b> Επιπλέον, οι προγραμματιστές δημιουργούν νέες σύνολα πληροφοριών για να αποθηκεύσουν άλλα δεδομένα όπως το επίπεδο του παιχνιδιού, τον χρόνο που έχει περάσει, το σκορ, τις ζωές, τα βραβεία που συλλέχθηκαν ...
eu: Scratcheko projektu bakoitzak pertsonaiei buruzko informazio multo bat behar du ongi exekutau ahal izateko. Adibidez, <b> pertsonaia bakoitzaren posizioa jakin behar dugu, seinalatzen ari den norabidea, tamaina, etab. </b> Gainera,programatzaileak informazio depositu berriak sor ditzazkegu beste datu motabatzuk gordetzeko, aurkitzen garen maila, pasatako denbora, puntakueta, bizitzak,jasotako sariak...adibidez.
ru: Каждый проект Scratch нуждается в хранении информации о персонажах в определенномпорядке, чтобы действовать правильно. Например, <b>нам нужно помнить положение каждого персонажа, его направление, размер, и т.п.</b> Кроме того, программист может создавать новые репозитории для хранения данных, такие как уровень, на котором находится игрок, потраченное время, рейтинг, число жизней, полученные награды ...

source: Each character of a Scratch project has a number of features, or attributes, that every moment of the project have value, and can be modified by programs. For example, a character has a certain size that can be modified by block 'resize for 10', making the character appear slightly larger. Following is the list of attributes that each character and blocks that can be used to modify:
el: Κάθε χαρακτήρας ενός έργου Scratch έχει έναν αριθμό από χαρακτηριστικά, που σε κάθε χρονική στιγμή έχουν μια τιμή που μπορεί να τροποποιηθεί από προγράμματα. Για παράδειγμα, ένας χαρακτήρας έχει συγκεκριμένο μέγεθος που μπορεί να τροποποιηθεί με την εντολή 'άλλαξε το μέγεθος του αντικειμένου κατά 10', κάνοντας τον χαρακτήρα να φαίνεται ελαφρώς μεγαλύτερος. Ακολουθεί η λίστα των χαρακτηριστικών του κάθε χαρακτήρα και των εντολών που μπορούν να χρησιμοποιηθούν για να τα τροποποιήσουν:
eu: Scratcheko projektu bateko pertsonaia bakoitzak ezaugarri edo atributujakin batzuk ditu, projektuaren exekuzio momentu bakoitzean balore bat daukate,eta programek eraldatzu ditzazkete. Adibidez, pertsonaiak tamaian jakin bat daukaeraldatua izan daitekeena tamaina aldaketa 10 blokearein, pertsonaia handiagoa delaikusiaraziz. Jarraian, pertsonaiak eraldatzeko erabili daitezkeen blokeen zerrendauzten dugu
ru: Каждый персонаж в Scratch, обладается несколькими атрибутами, которые в каждый момент имеют определенное значение, и могут быть изменены программами. Например, у персонажа есть размер и он может быть изменен блоком 'resize for 10', который делает персонаж несколько больше. Дальше представлены атрибуты спрайтов и блоки используемые для изменений:

source: Position:
el: Θέση:
eu: Posizioa:
ru: Положение

source: move (10) steps
el: κινήσου (10) βήματα
eu: (10) pausu mugitu
ru: идти (10) шагов

source: go to x:(0) y:(0)
el: πήγαινε στη θέση x:(0) και y:(0)
eu: x:(0) y:(0) [e]ra joan
ru: перейти в x:(0) y:(0)

source: glide (1) secs to x:(0) y:(0)
el: πήγαινε αργά για (1) δευτ. στη θέση x:(0) και y:(0)
eu: (1)segundutan x:(0) y:(0) (e)ra
ru: плыть (1) секунд в точку x:(0) y:(0)

source: set x to (0)
el: όρισε το x ίσο με (0)
eu: x=(0)
ru: установить x в (0)

source: set y to (0)
el: όρισε το y ίσο με (0)
eu: y=(0)
ru: установить y в (0)

source: change x by (0)
el: άλλαξε το x κατά (0)
eu: x aldaketa:(0)
ru: изменить x на (0)

source: change y by (0)
ru: изменить y на (0)

source: Size:
el: Μέγεθος:
eu: tamaina
ru: Размер:

source: change size by (10)
el: άλλαξε το μέγεθος του αντικειμένου κατά (10)
eu: tamaina aldaketa:(10)
ru: изменить размер на (10) &percnt;

source: set size to (120)
ru: установить размер (120) &percnt;

source: Orientation:
el: Κατεύθυνση:
eu: Orientazioa
ru: ориентация:

source: point in direction (90 v)
el: στρίψε προς την κατεύθυνση των (90 v) μοιρών
eu: (90 V) norabidea hartu
ru: повернуться в направлении (90 v)

source: point towards [v]
el: στρίψε προς το [v]
eu: (r)i begira jarri
ru: повернуться к [v]

source: turn cw (15) degrees
el: στρίψε δεξιά (15) μοίρες
eu: biratu cw (15) gradu
ru: повернуть вправо на (15) градусов

source: turn ccw (15) degrees
el: στρίψε αριστερά (15) μοίρες
eu: biratu ccw (15) gradu
ru: повернуть влево на (15) градусов

source: Costume:
el: Ενδυμασία:
eu: Mozorroa
ru: Костюм:

source: switch costume to [butterfly v]
el: άλλαξε την ενδυμασία σε [πεταλούδα v]
ru: изменить костюм на [бабочка v]

source: next costume
el: άλλαξε στην επόμενη ενδυμασία
eu: hurrengo mozorroa
ru: следующий костюм

source: change [color v] effect by (25)
el: άλλαξε το εφέ [χρώματος v] κατά (25)
ru: изменить [цвет v] эффект на (25)

source: set [color v] effect to (0)
el: όρισε το εφέ [χρώματος v] σε (0)
eu: kolorea efektua (0)
ru: установить эффект [цвет v] в (0)

source: Visibility:
el: Ορατότητα:
eu: Ikusgarritasuna:
ru: видимость:

source: show
el: εμφανίσου
eu: erakutsi
ru: показаться

source: hide
el: εξαφανίσου
eu: ezkutatu
ru: спрятаться

source: In addition to modifying the attributes of the characters, programmers can use other mechanisms to store information on a Scratch project. <b>One of these mechanisms are variables that can store a value to store different types of data that may need: at what level we are</b>, how many lives you have left, how many points we, how is called the user ...
el: Εκτός από το να τροποποιούν τα χαρακτηριστικά των αντικειμένων, οι προγραμματιστές μπορούν να χρησιμοποιούν και άλλους μηχανισμούς για να αποθηκεύουν πληροφορίες σε ένα έργο Scratch. <b>Ένας από τους μηχανισμούς είναι οι μεταβλητές οι οποίες μπορούν να αποθηκεύουν μια τιμή, ώστε να αποθηκεύουν διαφορετικούς τύπους δεδομένων που μπορεί να χρειάζονται: σε ποιο επίπεδο βρισκόμαστε</b>, πόσες ζωές έχουν απομείνει, πόσους βαθμούς έχουμε, ποιο είναι το όνομα του χρήστη κ.α.
eu: Pertsonaien ezaugarriak aldatzeaz gain, programatzaileak bestelakomekanismoak erabil ditzake proiektu batean informazioa gordetzeko .Scratch.<B> mekanismo hauetako batzuk aldagarriak dira, behar izan ditzazkegun datumota ezberdinak biltegiratzea ahalbideratzen du: zein mailatan gauden </b>,zenbat bizitza geratzen zaizkigun, zenbat puntu ditugun, erabiltzailearen izena...
ru: В дополнение к изменению атрибутов спрайта, программист может использовать другие механизмы сохранения информации в проекте. <b>Один из этих механизмов - переменные, в которых можно хранить разныетипы данных, которые могут пригодиться: на каком мы уровне</b>, сколько жизней осталось, сколько очков набрано, как зовут пользователя ...

source: To create a variable you have to go to the category of data, click on 'Create a variable' and give a name. In the example shown below we have given the name 'Points' as use it to store the number of points you get our character.
el: Για να δημιουργήσουμε μια μεταβλητή θα πρέπει να πάμε στην κατηγορία 'Δεδομένα', και να κάνουμε κλικ στην εντολή 'Δημιουργήστε μια μεταβλητή' και να δώσουμε ένα όνομα. Στο παρακάτω παράδειγμα έχουμε δώσει το όνομα 'Πόντοι' για να αποθηκεύσουμε τους πόντους του χαρακτήρα μας.
eu: Aldagai bat sortzeko datuak kategoriara joan behar duzu,klikatu'Aldagaia bat sortu' eta izena eman. Jarraian erakusten dugun adibidean'Puntuak' izena eman diogu, gure pertsonaiak lortu dituen puntuak gordetzeko erabiliko baita
ru: Чтобы создать переменную нужно войти в раздел данных, щелкнуть по 'Создать переменную' и присвоеить переменной имя. В следующем примере мы используем имя 'Points' чтобы хранить в ней число очков собранных вашим персонажем.

source: set [Points v] to [0]
el: όρισε το [Πόντοι v] σε [0]
eu: ezarri [Puntuak v][0]ra
ru: задать [Точки v] значение [0]

source: if &lt;touching color [#0000FF]&gt; then
el: εάν &lt; αγγίζει το χρώμα[#00000FF]?&gt; τότε
eu: &lt; ikutzen baduzu kolorea[#0000FF]&gt; orduan
ru: если &lt;касается цвета [#0000FF] ?&gt; , то

source: change [Points v] by (1)
el: άλλαξε το [Πόντοι v] κατά (1)
eu: aldatu [Points v] (1) gatik
ru: изменить [Точки v] на (1)

source: In the program of the top, we assign the number of points that we want the character has to the beginning of the game, in this case 0, for which we use the block <i>'fixing points at 0'</i>. However in the program of the right, what we do is that when the character touches the blue color, that could be a target, you will add a point, for which we use the block <i>'change Points by 1'</i>. In this case, the block <i>'change'</i> would check the current value of the variable points would add 1: If set to 0, I add 1 and is now worth 1; when set to 1, I add 1 and is now worth 2 ...
el: Σε αυτό το πρόγραμμα, αναθέτουμε το πλήθος των πόντων που έχει ο χαρακτήρας στην αρχή του παιχνιδιού, σε αυτή την περίπτωση το 0, για το οποίο χρησιμοποιούμε την εντολή <i>'όρισε το Πόντοι σε 0'</i>. Στη συνέχεια αυτό που κάνουμε είναι όταν ο χαρακτήρας ακουμπήσει το μπλε χρώμα, που είναι ο στόχος, παίρνουμε έναν βαθμό για τον οποίο χρησιμοποιούμε την εντολή <i>'άλλαξε το Πόντοι κατά 1'</i>.Σε αυτή την περίπτωση η εντολή <i>'άλλαξε'</i>θα ελέγξει την τρέχουσα τιμή της μεταβλητής και θα προσθέσει 1: Αν είχε ορισθεί σε 0, βάζει άλλο 1 και είναι τώρα 1; όταν έχει ορισθεί σε 1 βάζει άλλο 1 και τώρα έχει την τιμή 2 κ.τ.λ.
eu: Ezkerreko programan gure pertsonaiak zenbat punturekin hasi nahi duenesleituko dugu, kasu honetan 0
ru: В начале мы указываем количество очком, которые мы хотим, чтобы персонаж имел в начале игры, в данном случае 0, для чего мы используемблок <i>'fixing points at 0'</i>. В программе справа, что мы изменяем, если пресонаж касается голубого цвета, что может бытьдобычей, мы добавляем очко, для чего используем блок<i>'change Points by 1'</i>. В данном случае блок <i>'change'</i> проверит текущее значение переменной и добавит к нему 1: если это 0, до добавлю 1 и будет 1; если 1, добавим 1 и будет 2 ...

source: In addition to the variables, Scratch lets you use another data type to store project information: <b>The lists. The lists can store more than one value at the same time, so they are ideal for storing rewards have been recovered by a character or set of names, raise a couple of examples.</b>
el: Εκτός από τις μεταβλητές, το Scratch επιτρέπει να χρησιμοποιούμε και άλλους τύπους δεδομένων για να αποθηκεύσουμε πληροφορία σε ένα έργο: <b>Τις λίστες. Οι λίστες μπορούν να αποθηκεύσουν παραπάνω από μία τιμές και είναι ιδανικές για να αποθηκεύουμε ας πούμε τα δώρα που μάζεψε ένας χαρακτήρας, ένα σύνολο ονομάτων κ.α.</b>
eu: aldagarriez gain,Scratchek beste hainbat datu erabiltzeko aukera ematen duproiektu baten informazioa gorde ahal izateko: <b>listak. Listak denboraberean balio bat baino gehiago biltegiratzeko aukera ematen dute, idealakdirela errekuperatuak izan diren pertsonaia baten sariak gordetzeko, edo izenenpilaketa bat, bina adide plantatuz gero </b>
ru: В дополнение к переменным, Scratch позволяет использовать другой тип данных для хранения информации в проекте: <b>Списки. Списки могут хранить больше одного значения одновременно, так что они идеально подходят для хранения наград полученных персонажем или группы имен, как показано на примерах.</b>

source: To create a list, you have to go to the data category, click on 'Create a List' and give a name. In the example, we have named our 'Students' list:
el: Για να δημιουργήσετε μια λίστα θα πάτε στην κατηγορία 'Δεδομένα', και μετά 'Δημιουργήστε μια λίστα' και δώστε ένα όνομα. Στο παράδειγμα, έχουμε ονομάσει τη λίστα 'Μαθητές':
eu: Zerrenda bat sortzeko, datuak kategoriara joan behar da, 'Zerrena sortu'klikatu eta izena eman. Adibidean, gure zerrendari 'Ikasleak' deitu diogu.
ru: Чтобы создать переменную нужно войти в раздел данных, щелкнуть по, 'Создать Список' и дать списку имя. Например, мы назовем наш список 'Students':

source: delete (all v) of [Students v]
el: διάγραψε το (όλα v) από το [Μαθητές v]
eu: ezabatu (guztiak v)[Ikasleak v]tik
ru: удалить (все v) из [Ученики v]

source: repeat (3)
el: επανάλαβε (3)
eu: errepikatu (3)
ru: повторить (3) раз

source: ask [Introduce a student name] and wait
el: ρώτησε [Βάλε ένα όνομα μαθητή] και περίμενε
eu: galdetu [Ikasle baten izena jarri] eta itxaron
ru: спросить [Введите имя студента] и ждать

source: insert (answer) at (last v) of [Students v]
el: βάλε το (απάντηση) στη θέση [τελευταίο v] της λίστας [Μαθητές v]
eu: ezarri (erantzuna) (azkena v)n [Ikasleak v]an
ru: вставить (ответ) в [Ученики v] из (прошлой v)

source: What have we done with this program? The first thing we do is, to start execution, <b>delete all items from the list Students</b>, to empty it completely and not appear elements of an previous project implementation. Then we ask three times the user to enter a name, and each name entered insert it in the last position in the list Students.
el: Τι κάναμε σε αυτό το πρόγραμμα; Το πρώτο πράγμα που κάνουμε είναι να <b> διαγράφουμε όλα τα αντικείμενα από τη λίστα Μαθητές</b>, να την αδειάζουμε από όλα τα στοιχεία για να μην εμφανίζονται στοιχεία από προηγούμενες εκτελέσεις του έργου. Ύστερα ζητάμε τρεις φορές τον χρήστη να εισάγει ονόματα, και κάθε όνομα εισάγεται στην τελευταία θέση της λίστας 'Μαθητές'.
eu: Zer egin dugu programa honekin? Lehenengo gauza egingo duguna ejekuzioahasterakoa <b>ezabatu elementu guztiakI kaslae<b>listatik, guztiz usteko eta ezagertzeko exekuzioko elementurik ez agertzeko lehengo proiektukoa. Jarrianhiru aldiz eskatuko diogu usuarioari izena sar dezan eta sartutako izenbakoitza azkenengoan sartuko duguIkasle listaren posizioa
ru: Что мы делаем в этой программе? Прежде всего в начале выполнения, <b>удаляем все значения в списке Students</b>, опустошая его полностью от элементом, которые могли остаться от предыдущих проектов. После этого мы три раза просим пользователей назвать свои имена, и каждый раз добавляем имена в конец списка Students.
