Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: Please, go to the following page and choose a new password:
el: Παρακαλώ, ακολουθήστε τον παρακάτω σύνδεσμο για να δημιουργήσετε έναν νέο κωδικό:
eu: Mesedez, joan hurrengo orrira eta aukeratu pasaitza berria:
ru: Перейдите на следующую страницу и выберите новый пароль

source: Your username is:
el: Το όνομα χρήστη σας είναι:
eu: Zure erabiltizailea da:
ru: Ваш логин

source: We sended to you an email.
el: Σας στείλαμε ένα email.
eu: Posta bat bidali dizugu
ru: Мы послали вам почтовое сообщение

source: Check with your systems operator to see if the message was blocked.
el: Παρακαλώ ελέγξτε και στα Ανεπιθύμητα.
eu: Begiratu zure postan baztertutako mezuak eta egiaztatu ea mezurik dagoen
ru: Обратитесь к оператору своей почтовой системы, чтобы узнать, было ли сообщение заблокировано.

source: Type your new password:
el: Πληκτρολογήστε τον νέο σας κωδικό:
eu: Sartu zure pasaitza berria
ru: Напишите свой новый пароль

source: The Password and Confirm password fields are not identical.
el: Ο κωδικός και η επιβεβαίωση δεν συμφωνούν.
eu: Bi pasaitzek ez dute bat egiten
ru: Поля пароля и подтверждения не совпадают.

source: Have you forgotten your password? Please introduce your email:
el: Ξεχάσατε το κωδικό σας; Παρακαλώ εισάγετε το email σας:
eu: Pasaitza ahaztu al duzu? Sartuz zure posta mesedez:
ru: Вы забыли свой пароль? Укажите свой адрес электронной почты:

source: User doesn't exist or the password is incorrect.
el: Ο χρήστης δεν υπάρχει ή ο κωδικός είναι λανθασμένος.
eu: Erabiltzaile hau ez da zuzena edo ez da existitzen
ru: Пользователь не существует или пароль неверен.

source: You must to complete all the fields.
el: Πρέπει να συμπληρώσετε όλα τα πεδία.
eu: Eremu guztiak bete behar dituzu.
ru: Вы должны заполнить все поля.

source: Scores of 2015
el: Στοιχεία του 2015
eu: 2015eko emaitza

source: Number of projects analyzed in 2015
el: Αριθμός έργων που αναλύθηκαν το 2015
eu: 2015ean aztertutako proiektuak

source: Stats
el: Στατιστικά
eu: Estatistika

source: Come back to your Scratch project.
el: Ελάτε να δούμε το έργο σας.
eu: Itzuli zure Scratch proiektura

source: <input name='zipFile' type='file' class='filestyle' data-buttonText='Choose Project'>
el: <input name='zipFile' type='file' class='filestyle' data-buttonText='Επιλέξτε έργο'>
eu: <input name='zipFile' type='file' class='filestyle' data-buttonText='Aukeratu Proiektua'>

source: <input name='img' type='file' class='filestyle' data-buttonText='Choose img'>
el: <input name='csvFile' type='file' class='filestyle' data-buttonText='Επιλέξτε'>
eu: <input name='img' type='file' class='filestyle' data-buttonText='Aukeratu irudia'>

source: when gf clicked
el: Όταν στην πράσινη σημαία γίνει κλικ
eu: gf sakatzean

source: set size to (120) &percnt;
el: όρισε το μέγεθος του αντικειμένου σε (120)%%
eu: tamaina=(120)

source: end
el: τέλος
eu: amaiera

source: if &lt;not&lt; (level) = (5)&gt;&gt;then
el: εάν &lt;δεν ισχύει ότι&lt;(επίπεδο) = (5)&gt;&gt;τότε

source: if &lt;touching [the mouse pointer v]? &gt;
el: εάν &lt;αγγίζει το [δείκτη του ποντικού v]? &gt; τότε
eu: baldin &lt;ikutzen[xaguren erakuslea]? &gt;

source: forever //Blocks that dont's start with a hat block.
el: για πάντα //Εντολές που δεν ξεκινούν με συμβάν (εντολή καπέλο)

source: These situations usually causes that projects doesn't work as expected of them,so,try to avoid dead code in your programs!
el: Αυτές οι καταστάσεις συνήθως δημιουργούν προγράμματα που δεν δουλεύουν με τον αναμενόμενο τρόπο και καλό είναι να αποφεύγονται.

source: Imagine that in a project we have two programs formed by the same blocks and where only vary the parameters or values of the blocks.
el: Σκεφτείτε ότι σε ένα έργο έχουμε δύο προγράμματα κατασκευασμένα με τις ίδιες εντολές και η μόνη διαφορά είναι οι τιμές στις παραμέτρους των εντολών.

source: Thus, if you want a change, you just have to go to the block defined by the programmer.
el: Έτσι, όταν χρειαστείτε μια αλλαγή, θα πάτε στην εντολή που ορίσατε.

source: When you start to programming with Scratch, is very usually to leave the default name of the new characters(sprite 1, sprite2, ...). When we have few characters, is very easy to know what character have each name. However, when the number of characters increases, it's more complicated. So, is a good practice naming(to recognize easily) each character of our projects, because our programs can be read more fast. Avoid default names!
el: Όταν ξεκινάτε να προγραμματίζετε με το Scratch, είναι πολύ συνηθισμένο να αφήνετε τα προκαθορισμένα ονόματα για τους νέους χαρακτήρες (Αντικείμενο 1, Αντικείμενο 2, ...) Όταν έχουμε πολλούς τέτοιους χαρακτήρες, είναι πιο εύκολο να αναγνωρίζουμε τον κάθε χαρακτήρα από το όνομά του. Έτσι, μια καλή πρακτική είναι να ονοματίζουμε τον χαρακτήρα του έργου μας με ένα όνομα που να έχει σημασία ώστε το πρόγραμμά μας να μπορεί να διαβάζεται πιο εύκολα. Αποφύγετε τα προκαθορισμένα ονόματα!

source: Sign in
el: Είσοδος
eu: Izena eman

source: Coming
el: Έρχονται
eu: Hurrengoak

source: <input type='password' name='password_confirm' id='password_confirm' placeholder='Password'/>
el: <input type='password' class='form-control' name='password_confirm' placeholder='Password'>
eu: <input type='password' name='password_confirm' id='password_confirm' placeholder='Pasahitza'/>

source: Confirm your password:
el: Επιβεβαιώστε τον κωδικό:
eu: Baieztatu zure pasaitza

source: Dr. Scratch(Beta Version)
eu: Dr. Scratch(Beta Bertsioa)

source: Best practice
eu: Praktika hobeak

source: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/your_number" type="text">
eu: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/zure_zenbakia" type="text">

source: says..
eu: dio..

source: Teacher: Jorge Lobo
eu: Irakaslea: Jorge Lobo

source: Teacher: Chema Gonzalez
eu: Irakaslea: Chema Gonzalez

source: project.png
eu: proiektua.png

source: <input type='text' name='username' id='username' placeholder='Username' />
eu: <input type='text' name='username' id='username' placeholder='Erabiltzailea' />

source: <input type='password' name='password' id='password' placeholder='Password'/>
eu: <input type='password' name='password' id='password' placeholder='Pasahitza'/>

source: <input type='password' class='form-control' name='password' placeholder='Password'>
eu: <input type='password' class='form-control' name='password' placeholder='Pasahitza'>
