Repository: AngelaVargas/drscratchv3
Catalog: locale/*/LC_MESSAGES/django.po
Languages: el, eu, ru

source: Spanish
el: Ισπανικά
eu: Gaztelania
ru: Испанский

source: English
el: Αγγλικά
eu: Ingelesa
ru: Английский

source: Catalan
el: Καταλανικά
eu: Katalana
ru: Каталонский

source: Galician
el: Γλώσσα της Γαλικίας
eu: Galiziera
ru: Галисийский

source: Portuguese
el: Πορτογαλικά (Βραζιλίας)
eu: Porugalera
ru: Португальский

source: Greek
el: Ελληνικά
eu: Greziera
ru: Греческий

source: Basque
el: Βασκικά
ru: Баскский

source: Scores of 2019
ru: Результаты 2019 года

source: points
el: βαθμοί
eu: puntuak
ru: баллов

source: Total score
el: Γενικό σύνολο
eu: Emaitza guztiak
ru: Общий счет

source: Number of projects analyzed in 2019
ru: Число проанализированных проектов в 2019

source: projects
el: έργα
eu: proiektuak
ru: проектов

source: Total projects
el: Συνολικά έργα
eu: Proiektu guztiak
ru: Всего проектов

source: Percent levels
el: Επίπεδα επί τοις εκατό
eu: Ehuneko mailak
ru: Уровни

source: Level
el: Επίπεδο
eu: Maila
ru: Уровень

source: Basic
eu: Oinarrizkoa
ru: Базовый

source: Development
eu: Erdi-mailakoa
ru: Совершенствующийся

source: Master
el: Μετάφραση:
eu: Aurreratua
ru: Мастер

source: Average rate by code smell
el: Μέσος όρος με βάση την ανάλυση κώδικα
eu: Programazio joera txarrarengatik jasotako bataz besteko puntuak
ru: Средняя оценка качества кода

source: Code smell
el: Ανάλυση κώδικα
eu: Kode ezegokia
ru: Плохой код

source: Dead code
el: Κώδικας που δεν εκτελείται
eu: Kode baliogabea
ru: Мёртвый код

source: Duplicated scripts
el: Διπλασιασμένα προγράμματα
eu: Bikoiztutako scriptak
ru: Дубликаты скриптов

source: Attribute initialization
el: Αρχικοποίηση ιδιοτήτων
eu: Ongi hasieratzen ez diren atributuak
ru: Инициализация атрибута

source: Sprite naming
el: Ονόματα αντικειμένων
eu: Izen ezegokiak
ru: Название спрайтов

source: Backdrop naming
ru: именование фона

source: Average rate by programming skill
el: Μέσος όρος με βάση την προγραμματιστική δεξιότητα
eu: Bataz besteko puntuak programatzeko gaitasunarengatik
ru: Средняя оценка навыков программирования

source: Programming skill
el: Προγραμματιστική δεξιότητα
eu: Programazio gaitasuna
ru: Навыки программирования

source: Parallelism
el: Παραλληλισμός
eu: Paralelismoa
ru: Параллельность действий

source: Logic
el: Λογική
eu: Logika
ru: Логика

source: Flow control
el: Έλεγχος ροής
eu: Kontrol fluxua
ru: Управление потоком

source: User interactivity
el: Αλληλεπίδραση χρήστη
eu: Erabiltzailearen elkarreragiletasuna
ru: Интерактивность

source: Data representation
el: Αναπαράσταση δεδομένων
eu: Datu adierazlea
ru: Представление данных

source: Abstraction
el: Αφαίρεση
eu: Abstrakzioa
ru: Абстракция

source: Synchronization
el: Συγχρονισμός
eu: Sinkronizatzea
ru: cинхронизация

source: <input type='submit' value='Change language' class='btn-group btn-group-justified colored-text'/>
eu: <input type='submit' value='Hizkuntza aldatu' class='btn-group btn-group-justified colored-text'/>
ru: <input type='submit' value='Сменить язык' class='btn-group btn-group-justified colored-text'/>

source: Logged in as
el: Εισήλθατε ως
eu: Erabiltzailea:
ru: Войти как

source: Change password
el: Αλλάξτε κωδικό
eu: Aldatu pasahitza
ru: Изменить пароль

source: Logout
el: Έξοδος
eu: Irten
ru: Выйти

source: Analysis
eu: Analisia
ru: Анализ

source: Learn more
el: Μάθετε περισσότερα
eu: Gehiago jakin
ru: Узнать больше

source: Incorrect names
el: Λάθος ονόματα
eu: Izen okerrak
ru: Неверные имена

source: Settings
eu: Ezarpenak
ru: Настройки

source: ©2014 Dr. Scratch is powered by
el: ©2014 Το Dr. Scratch λειτουργεί από
eu: ©2014 Dr. Scratchen garatzailea:
ru: ©2014 Dr. Scratch поддерживается

source: How is the file .csv?
el: Πώς είναι ένα αρχείο .csv;
eu: Nola sortu .csv dokumentua?
ru: Как насчет .csv файла?

source: You must to write only the number of your students' projects. Easy, isn't it?
el: Πρέπει να γράψετε μόνο τους αριθμούς των μαθητών σας. Εύκολο, έτσι;
eu: Zure ikasleen proiektu kopurua idatzi behar duzu. Erraza, ezta?
ru: Вам нужно записать только число проектов ваших учеников. Правда, просто?

source: What is an url?
el: Τι είναι το url;
eu: Zer da URL bat?
ru: Что такое url?

source: How I can know my Scratch project's url?
el: Πώς μπορώ να βρώ το url του έργου μου στο Scratch;
eu: Nola jakin dezaket nire Scratch proiektuaren URLa?
ru: Как я могу узнать url моего проекта?

source: I want to download my project from Scratch!
el: Θέλω να κατεβάσω το έργο μου από τον ιστότοπο του Scratch!
eu: Nere proiektua Scratch-etik jaitsi nahi dut!
ru: Я хочу загрузить свой Scratch проект!

source: How I can download my Scratch project to my computer?
el: Πώς μπορώ να κατεβάσω το έργο στον υπολογιστή μου;
eu: Nola jaitsi dezaket nire Scratch proiektua ordenagailura?
ru: Как я могу загрузить свой Scratch проект на свой компьютер?

source: Wait a moment, please.
el: Περιμένετε...
eu: Itxaron momentu bat, mesedez.
ru: Подождите секунду

source: loading...
el: περιμένετε...
eu: Kargatzen...
ru: загружается...

source: Score
el: Σκορ
eu: Puntuazioa
ru: Количество очков

source: This section shows the total score.
el: Η ενότητα αυτή εμφανίζει το συνολικό σκορ
eu: Atal honek emaitza guztia erakusten du.
ru: Здесь показано общее число очков

source: Certificate
eu: Ziurtagiria
ru: Сертификат

source: Download your certificate!
eu: Jaitsi zure ziurtagiria!
ru: Скачайте свой сертификат!

source: Score in detail
el: Το σκορ αναλυτικά
eu: Zure emaitza xehetua
ru: Детальный результат

source: Here we show the score in each programming skill as well as links to sites that can help you to level up.
eu: Hemen erakusten dizugu programazio gaitasun bakoitzeko kalifikazioa eta berau hobetzeko estekak.
ru: Здесь мы показываем оценку в каждом навыке программирования, а также ссылки на участкикоторые могут помочь вам повысить свой уровень.

source: HELP
eu: LAGUNTZA
ru: ПОМОЩЬ

source: Score:
el: Σκορ:
eu: Kalifikazioa:
ru: Очки:

source: I have just obtained %(points)s points analyzing my project in Dr. Scratch! Beat it! @DrScratchTool
el: Μόλις πήρα %(points)s αναλύοντας το έργο μου με το Dr. Scratch! Μπορείτε να πάτε καλύτερα; @DrScratchTool
eu: Nire proiektua Dr. Scratch-en aztertuta %(points)s puntuak lortu ditut!Ea gainditzeko gai zaren! @DrScratchTool
ru: Я только что получил %(points)s очков при анализе своего проекта в Dr. Scratch! Побей результат! @DrScratchTool

source: <h3 class='text-left dark-text'>The level of your project is... <strong>BASIC! </strong></h3>
el: <h3 class='text-left dark-text'>Το επίπεδό σας είναι... <strong>BASIC! </strong></h3>
eu: <h3 class='text-left dark-text'>Zure proiektuaren maila...<strong>OINARRIZKOA da! </strong></h3>
ru: <h3 class='text-left dark-text'>Уровень этого проекта... <strong>Начинающий! </strong></h3>

source: You're at the beginning of a <br>great adventure . . . Keep it up!
el: Είστε στην αρχή μιας <br>μεγάλης περιπέτειας . . . Συνεχίστε!
eu: Abentura handi bat hastera zoaz!</br> Horrela jarraitu!
ru: Вы в начале <br>великого путешествия . . . Продолжайте!

source: Project certificate
eu: Proiektuaren ziurtagiria
ru: Сертификат проекта

source: Download
el: Κατεβάστε
eu: Jaitsi
ru: Скачать

source: Level up
eu: Mailaz igo
ru: Повысить уровень

source: Bad habits in programming
el: Κακές προγραμματιστικές συνήθειες
eu: Joera txarrak programatzean
ru: Плохие привычки программирования

source: If you correct your bad habits in programming, you will avoid problems in the future.
el: Εάν διορθώσετε τις κακές προγραμματιστικές συνήθειες θα αποφύγετε προβλήματα στο μέλλον.
eu: Programtatzen zure joera txarrak zuzenduz gero, arazoak saihestuko dituzu etorkizunean
ru: Если вы измените свои плохие привычки, то избежите проблем в будущем.

source: <h3 class='text-left dark-text'>The level of your project is... <strong>DEVELOPING! </strong></h3>
el: <h3 class='text-left dark-text'>Το επίπεδό σας είναι... <br></br> <strong>DEVELOPING! </strong></h3>
eu: <h3 class='text-left dark-text'>Zure proiektuaren maila...<strong>ERDI-MAILA da! </strong></h3>
ru: <h3 class='text-left dark-text'>Уровень вашего проекта... <strong>РАЗРАБОТЧИК! </strong></h3>

source: You're doing a great job. Keep it up!!!
el: Κάνετε καλή δουλειά. Συνεχίστε έτσι!!!!
eu: Lan handia egiten ari zara, jarraitu horrela!!
ru: Вы сделали отличную работу. Продолжайте!!!

source: Bad habits
ru: плохие привычки

source: Sprites attributes
el: Ιδιότητες αντικειμένων
eu: Ongi hasieratzen ez diren atributuak
ru: Атрибуты спрайта

source: sprite attributes.
el: ιδιότητες αντικειμένων.
eu: Ongi hasieratzen ez diren atributuak
ru: атрибуты спрайта.

source: Your project does not have uninitialized attributes, good job!
el: Στο έργο σας όλες οι ιδιότητες αρχικοποιούνται. Μπράβο!
eu: Zure proiektuak hasieratzen ez diren atributurik ez du, lan bikaina!
ru: В вашем проекте нет неинициализированных атрибутов, хорошая работа!

source: sprite naming.
el: ονόματα αντικειμένων.
eu: sprite-a izendatzen
ru: название спрайта.

source: Your project does not have default sprite naming, good job!
ru: Ваш проект не имеет имени спрайта по умолчанию, хорошая работа!

source: backdrop naming.
ru: именование фона.

source: Your project does not have default backdrop naming, good job!
ru: Ваш проект не имеет заданного по умолчанию именования фона, хорошая работа!

source: <h3 class='text-left dark-text'>The level of your project is... <strong> MASTER! </strong></h3>
el: <h3 class='text-left dark-text'>Το επίπεδό σας είναι... <strong>MASTER! </strong></h3>
eu: <h3 class='text-left dark-text'>Zure proiektuaren maila... <strong> AURRERATUA da! </strong></h3>
ru: <h3 class='text-left dark-text'>Уровень вашего проекта...... <strong> Мастер! </strong></h3>

source: You're the master of the universe!!!
el: Είστε ο άρχοντας του σύμπαντος!
eu: Unibertso osoko maisua zara!!
ru: Вы мастер!!!

source: duplicated scripts.
el: διπλασιασμένα προγράμματα
eu: bikoiztutako scriptak.
ru: дубликатов спрайтов.

source: Your project does not have duplicated scripts, good job!
ru: У вашего проекта нет дубликатов скриптов, хорошая работа!

source: dead code.
el: κώδικας που δεν εκτελείται.
eu: kode baliogabea.
ru: мертвый код.

source: Your project does not have dead code, good job!
el: Το έργο σας δεν έχει κώδικα που δεν εκτελείτε, μπράβο!
eu: Zure proiektuak ez du baliogabeko koderik!
ru: В вашем проекте нет мертвого кода, хорошая работа!

source: Download my CSV files.
el: Κατεβάστε το αρχείο .csv
eu: Nire CSV fitxategiak jaitsi
ru: Скачать мой CSV файл

source: Here you can download the CSV files previously analyzed.
eu: Hemen aurretik aztertertutako CSV fitxategiak jaitsi ditzakezu
ru: Здесь вы можете скачать CSV файл, который анализировали раньше

source: Date
eu: Data
ru: Дата

source: Downloads
el: Κατεβάστε το αρχείο .csv
eu: Deskargak
ru: Скачиваний

source: New coder in Dr. Scratch!
eu: Coder berria Dr. Scratch-en!
ru: Новый кодер в Dr. Scratch!

source: You're receiving this email because you have successfully signed up in Dr. Scratch.
eu: Mezu hau Dr. Sratch-en saioa ongi hasi duzulako jaso duzu.
ru: Вы получили это сообщение, потому что успешно зарегистрировались в Dr. Scratch.

source: Thanks for using our website!
el: Ευχαριστούμε που χρησιμοποιείτε τον ιστότοπό μας!
eu: Eskerrik asko gure webgunea erabiltzeagatik!
ru: Спасибо, что используете наш вебсайт

source: The Dr. Scratch team
el: Η ομάδα του Dr. Scratch
eu: Dr. Scratch taldea
ru: Команда Dr. Scratch

source: Do you want to analyze one project?
eu: Proiekturik aztertu nahi al duzu?
ru: Хотите проанализировать свой проект?

source: There are two options to analyze your Scratch project now!
el: Υπάρχουν δύο επιλογές για να αναλύσετε ένα έργο με το Dr. Scratch τώρα!
eu: Bi aukera dituzu zure Scratch proiektua oraintxe bertan aztertzeko!
ru: Существует два варианта анализа проектов

source: 1. Introduce the <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> of your Scratch project, you don't have to download it:
el: 1. Εισάγετε το <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> του έργου σας, δεν χρειάζεται να το κατεβάσετε:
eu: 1. Sartu ezazu zure Scratch proiektuaren <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>URLa</a></span>, ez da beharrezkoajaistea:
ru: 1. Представьте <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> вашего Scratch проекта, без необходимости скачивать его:

source: Analyze by url
el: Αναλύστε με βάση το url
eu: URLaren bidez aztertu
ru: Анализ по url

source: 2. If you have your <span class='colored-text'><a data-toggle='modal' href='#modalProject'>project</a></span> downloaded in the computer you can analyze it here:
el: 2. Εάν έχετε <span class='colored-text'><a data-toggle='modal' href='#modalProject'>το έργο σας </a></span> στον υπολογιστή σας αναλύστε το εδώ:
eu: 2. Zure <span class='colored-text'><a data-toggle='modal' href='#modalProject'>proiektua</a></span> ordenagailuan baduzu,hemen aztertu dezakezu:
ru: 2. Есои ваш <span class='colored-text'><a data-toggle='modal' href='#modalProject'>проект</a></span> скачан на компьютер, то вы можете анализировать его тут:

source: Analyze my project
el: Ανάλυσε το έργο μου
eu: Aztertu nire proiektua
ru: Анализировать мой проект

source: Error! Please choose a .sb or .sb2 file or input an url
el: Σφάλμα! Επιλέξτε ή ένα αρχείο .sb ή ένα αρχείο .sb2 ή εισάγετε ένα url
eu: Errorea! Mesedez aukeratu .sb edo .sb2 fitxategia edo URLa
ru: Ошибка! Пожалуйста, выберите .sb или .sb2 файл или введите url

source: Error! Your project id is wrong
el: Σφάλμα! Το id του έργου σας είναι λανθασμένο.
eu: Errorea! Zure proiektuaren id-a ez da zuzena
ru: Ошибка! id вашего проекта неверен

source: Error! Your project doesn't exist in Scratch's servers
el: Σφάλμα! Το έργο σας δεν υπάρχει στον ιστότοπο του Scratch
eu: Errorea! Zure proiektua ez da existitzen Scratch-eko zerbitzarietan
ru: Ошибка! Вашего проекта нет на сайте Scratch

source: Password
el: Κωδικός
eu: Pasahitza
ru: Пароль

source: Change my password
el: Αλλάξτε κωδικό
eu: Aldatu pasahitza
ru: Изменить мой пароль

source: Photo
eu: Irudia
ru: Фотография

source: Change my photo
eu: Aldatu irudia
ru: Изменить мое фото

source: Statistics
el: Στατιστικά
eu: Estatistikak
ru: Статистика

source: Wait a moment please
el: Περιμένετε...
eu: Itxaron momentu bat, mesedez
ru: Подождите секунду

source: What do you think about Dr. Scratch?
eu: Zer deritzozu Dr. Sratch-i buruz?
ru: Что вы думаете о Dr. Scratch?

source: Leave your comment
eu: Eman zure iritzia
ru: Оставьте свой комментарий

source: Sign up or sign in
eu: Kontua sortu edo saioa hasi
ru: Зарегистрироваться или войти в систему

source: Tell us what do you think about Dr. Scratch, your thoughts, suggestions,etc...
eu: Eman zure iritzia Dr.Scratch-i buruz, zure ideiak, iradokizunak, etab.
ru: Расскажите нам, что вы думаете о Dr. Scratch, о своих мыслях, предложениях,и т.п...

source: Hi
eu: Kaixo
ru: Привет

source: Message
eu: Mezua
ru: Сообщение

source: Send
el: Αποστολή
eu: Bidali
ru: Отправить

source: Error
el: Σφάλμα
eu: Errorea
ru: Ошибка

source: ERROR 404 - Page Not Found
el: Σφάλμα 404 - Η σελίδα δεν βρέθηκε
eu: 404 ERROREA - Aurkitu gabeko orrialdea
ru: Ошибка 404 - страница не найдена

source: Ops! This page doesn't exist
el: Ώπα! Αυτή η σελίδα δεν υπάρχει
eu: Ops! Orrialde hau ez da existitzen
ru: Эта страница не существует

source: Get Started
el: Ξεκίνα
eu: Hasi
ru: Начнем

source: 500 - Internal Server Error
el: 500 - Εσωτερικό σφάλμα διακομιστή
eu: 500 - Zerbitzariaren barne errorea
ru: 500 - - Внутренняя ошибка сервера

source: We apologize for this inconvenience
el: Ζητούμε συγγνώμη για την ταλαιπωρία
eu: Barkatu eragozpenak
ru: Приносим свои извинения за доставленные неудобства

source: There was an error analyzing your project
el: Υπήρξε ένα σφάλμα κατά την ανάλυση του έργου σας
eu: Akats bat izan da zure proiektua aztertzeko orduan
ru: При анализе вашего проекта произошла ошибка

source: Sometimes we have got problems analyzing some projects. We're working on this.
el: Μερικές φορές έχουμε προβλήματα αναλύοντας ορισμένα έργα. Δουλεύουμε ώστε να το διορθώσουμε.
eu: Batzuetan arazoak ditugu proiektuak aztertzerakoan. Lanean gabiltza arazoa konpondu dadin
ru: Иногда у нас возникают проблемы с анализом некоторых проектов. Мы работаем над этим.

source: This name already exists. Choose another, please.
el: Αυτό το όνομα υπάρχει ήδη. Παρακαλώ επιλέξτε άλλο.
eu: Izen hau jadanik existitzen da. Aukeratu beste bat, mesedez
ru: Это имя уже существует. Выберите другое, пожалуйста

source: This email already exists. Choose another, please.
el: Αυτό το email υπάρχει ήδη. Παρακαλώ επιλέξτε άλλο.
eu: Email hau jadanik existitzen da. Aukeratu beste bat, mesedez
ru: Эта почта уже существует. Выберите другую, пожалуйста

source: This hash doesn't exist.
el: Αυτό το κλειδί δεν υπάρχει.
eu: Pasahitz hau ez da existitzen
ru: Этот хеш не существует

source: You must to complete all fields.
el: Πρέπει να συμπληρώσετε όλα τα πεδία.
eu: Bete eremu guztiak behar bezala.
ru: Вам нужно заполнить все поля

source: The password and the password confirmation must be the same.
el: Ο κωδικός και η επιβεβαίωση δεν συμφωνούν.
eu: Pasahitza eta pasahitzaren egiaztapena berdinak izan behar dira.
ru: Пароль и подтверждение пароля должны быть одинаковыми.

source: The email and the email confirmation must be the same..
ru: Почта и подтверждение почты должны быть одинаковыми.

source: Retry
el: Ξαναπροσπαθήστε
eu: Saiatu berriz
ru: Попробуйте еще раз

source: The ability of abstraction and decomposition of problems helps you to <b>break a problem into smaller parts that are easier to understand, program and debug.</b>
el: Η ικανότητα αφαίρεσης και αποδόμησης προβλημάτων σας βοηθά να <b>χωρίζετε το πρόβλημα σε μικρότερα μέρη που είναι ευκολότερο να τα κατανοήσετε, να τα προγραμματίσετε και να κάνετε αποσφαλμάτωση.</b>
eu: Abstrazioaren eta arazoen deskonpozisioaren gaitasuanak<b>arazoak zati txikitan banatzen eta errezagoulertzen, programatzen eta garbitzen</b> laguntzen dizu.
ru: Способность к абстракции и декомпозиции проблем поможет вам <b>разбить проблему на мелкие части, которые проще понимать, программировать и отлаживать</b>

source: If you get 0 points...
el: Αν πήρατε 0 βαθμούς
eu: 0 puntu lortuz gero...
ru: Если вы набрали 0 очков

source: When you start programming with Scratch, sometimes it may seem that the simplest solution is to program all the behavior of a character in a single program. However, <b>ideally is that character behavior is controlled by different programs and each of these programs deal with a particular issue</b>. Here's an example:
el: Όταν ξεκινάτε τον προγραμματισμό με το Scratch, μερικές φορές μπορεί να φαίνεται ότι η απλούστερη λύση είναι να προγραμματίσετε όλη τη συμπεριφορά ενός χαρακτήρα σε ένα μόνο πρόγραμμα. Όμως, <b>ιδανικά η συμπεριφορά ενός χαρακτήρα ελέγχεται από διαφορετικά προγράμματα και κάθε ένα από αυτά τα προγράμματα αντιμετωπίζει ένα συγκεκριμένο θέμα</b>. Να ένα παράδειγμα:
eu: Scratch-ekin programatzean, batzuetan badirudi interbideazkarrena programa bakar batean pertsonaia baten izera guztia programatzeadela. Hala ere,<b>haien izaerak kontrolatzea hainbat programa erabilizaukera aparta da.</b>ikusi dezagun adibidea:
ru: Когда вы начинаете программировать на Scratch, может показаться, что самое простое решение состоит в том, чтобы заключить все поведение героя в одну программу. Однако, <b>лучше контролировать поведение персоннажанексколькими программами, каждая из которых решала бы отдельную проблему</b>. Напимер:

source: when green flag clicked
ru: когда щёлкнут по зелёному флагу

source: clear
el: καθάρισε
eu: ezabatu
ru: стереть всё

source: go to x:(-100) y:(30)
el: πήγαινε στη θέση x:(-100) και y:(30)
eu: x:(-100) y:(30)[e]ra joan
ru: перейти в x:(-100) y:(30)

source: pen down
el: κατέβασε την πένα
eu: arkatza jaitsi
ru: опустить перо

source: move (200) steps
el: κινήσου (200) βήματα
eu: (200) pausu mugitu
ru: идти (200) шагов

source: pen up
el: σήκωσε την πένα
eu: arkatza igo
ru: поднять перо

source: wait (1) secs
el: περίμενε (1) δευτερόλεπτα
eu: (1) segunduz itxaron
ru: ждать (1) секунд

source: go to x:(-44) y:(-24)
el: πήγαινε στη θέση x:(-44) και y:(-24)
eu: x:(-44) y:(-24)[e]ra joan
ru: перейти в x:(-44) y:(-24)

source: set pen color to [#FFA500]
el: όρισε το χρώμα πένας σε [#FFA500]
eu: arkatzaren kolorea =[#FFA500]
ru: установить цвет пера [#FFA500]

source: move (100) steps
el: κινήσου (100) βήματα
eu: (100) pausu mugitu
ru: идти (100) шагов

source: This project, which paints a picture on the screen, has been programmed in a single program that draws the two lines that make up the drawing. Although it is a valid option, a simpler option to program and maintain the program is divided into two parts, so that we have two different programs, one to paint the front and another to paint the second:
el: Αυτό το έργο, που ζωγραφίζει μια εικόνα στην οθόνη, έχει προγραμματιστεί σε ένα πρόγραμμα που ζωγραφίζει τις δύο γραμμές που αποτελούν τη ζωγραφιά. Αν και αυτή είναι μια εναλλακτική, θα ήταν πιο απλό να προγραμματίσετε ένα πρόγραμμα που είναι χωρισμένο σε δύο μέρη, έτσι ώστε να έχουμε δύο διαφορετικά προγράμματα, ένα για να ζωγραφίζει την πρώτη γραμμή και ένα για να ζωγραφίζει την δεύτερη:
eu: Irudia marrazten duen proiektu hau, bi marrak osatzen duten programa bakar batean programatu da. Aukera egokia izan arren, bi zatitan bananduz gero, errazagoa litzateke programatzeko eta mantetzeko. Bat lehenengoa marrazteko eta bestea bigarrena marrazteko.
ru: Этот проект, который рисует изображение на экране, был запрограммирован в одной программа, которая рисует две линии, составляющие рисунок. Хотя это допустимый вариант, более простой вариант для программирования состоит в том, чтобы разделить программму на две части, первая из которыхрисует первую часть, а вторая вторую:

source: Thus, if we make any changes eg in one of the lines drawn, it is much easier to know which part of the program we need to go to carry out the changes.
el: Έτσι, αν κάνουμε αλλαγές π.χ. σε μία από τις δυο γραμμές, θα είναι πολύ πιο εύκολο να γνωρίζουμε σε ποιο τμήμα του προγράμματος θα πρέπει να κάνουμε αυτές τις αλλαγές.
eu: Modu honetan, adibidez eraldaketa bat egin nahi badugu, marraztuta ditugun lerroetan askoz ere errexago jakin dezakegu programaren zein zati aldatu behar dugun.
ru: Таким образом, если мы вносим какие-либо изменения, например, в одну из линий, нарисованных, это намного проще знать, какую часть программы нам нужно поправить, чтобы осуществить изменения.

source: If you get 1 point...
el: Αν πήρατε 1 βαθμό...
eu: Puntu bat izanez gero...
ru: Если вы получили 1 балл

source: Scratch allows new user-defined blocks that consist of a sequence of instructions. These abstractions allow you to create simple programs to read, program and maintain. Here's an example:
el: Το Scratch σας επιτρέπει να δημιουργήσετε τις δικές σας εντολές που αποτελούνται από μια σειρά από οδηγίες. Τέτοιες αφαιρέσεις σας επιτρέπουν να δημιουργείτε προγράμματα που είναι απλά στον προγραμματισμό και την διατήρηση. Να ένα παράδειγμα:
eu: Scratch-ek erabiltzaile berak sortutako blokeak erabiltzen uzten digu. Erabiltzaileak argibide zehatzak emateko, Horrek laguntzen diguprograma berriak sortzea irakurtzeko,mantentzeko eta programatzeko errezagoak direnak. Ikusi dezagun adibide bat:
ru: Scratch позволяет создавать новые пользовательские блоки, которые состоят из последовательности инструкций. Эти абстракции позволяют создавать простые программы для для чтения, программирования и обслуживания. Вот пример:

source: go to x:(-200) y:(40)
el: πήγαινε στη θέση x:(-200) και y:(40)
eu: x:(-200) y:(40) [e]ra joan
ru: перейти в x:(-200) y:(40)

source: go to x:(-200) y:(0)
el: πήγαινε στη θέση x:(-200) και y:(0)
eu: x:(-200) y:(0) [e]ra joan
ru: перейти в x:(-200) y:(0)
